//
// Created by rkolyan on 27.01.2025.
//

//TODO: Китайская теорема об остатках
//TODO: А не, походу опять динамическое программирование
/*
Итак, A,B,C за обмен i-й на j-й отдаешь a_i и получаешь a_j
Рекурсия d[x][y][z] = d[x - a_x][y+a_y][z] + 2 аналогичных операции

Не, там могут быть повторения
Не то получается используем очередь, только как избегать пересечений (только с помощью множества)?
В любом случае, походу придется использовать multiset и обходить в обратном порядке
*/

#include <iostream>
#include <set>

/*
Как вариант, сначала строим 
сначала смотрим состояния после удаления ax, 2ax, 3ax элементов из x
Дальше удаляем из z / az + y / ay
*/

int main(void) {
    unsigned int a = 0, b = 0, c = 0, a_c = 0, b_c = 0, c_c = 0;
    std::cin >> a_c >> b_c >> c_c >> a >> b >> c;
    int count1 = a / a_c + 1;
    int count2 = b / b_c + (c * b_c) / c_c + 1;
    int count = 0;
    for (int i = 0; i < count1; i++) {
        count += count2 + i;
    }
    std::cout << count;
    return 0;
}