#include <iostream>

int main(void) {
    //Нужно все подмассивы, содержащие тройку, не обязательно подряд идущих трех элементов, являющиеся членами арифметической прогрессии
    /*
    Формулируем иначе, нужно найти количество таких arr[l...r], таких что существует i,j,k, l <= i < j < k <= r, что arr[k] - arr[j] = arr[j] - arr[i]
    можно сказать 2 * arr[j] = arr[i] + arr[k]
    Можно попробовать решить эту задачу от обратного: найти общее количество всех возожмоных подмассивов и из них вычесть количество массивов не содержащих
    такие тройки.
    Пусть M-общее количество таких подмассивов B массива arr, что |B| >= 3
    Пусть |arr| = n
    1 2 3 4 5 6 7
    1,2,3 | 2,3,4 | 3,4,5

    сумма n элементов = n(n+1)/2
    1 2 3 4 5
    s = 6 * 5 / 2 = 15
    тогда M = (n-2)+(n-3)+...+1 = (n-2)(n-1)/2

    Итак, суть, для каждого l, находим минимальную такую r_min, чтобы внутри лежала нужная нам тройка
    помимо этого находим l_max \in [l, r_min] (l_max - первое значени тройки, r_min - последнее)
    Далее находим количество всех подмассивов B для arr[l, r_min] (M(n) = (n-2)(n-1)/2, n = r_min - l + 1, count += M(n)-1)
    Далее, считаем l = l_max+1 ищем следующее r_min 
    тут нужно по-хорошему сохранять предыдущие значения l_max и r_min, чтобы уже посчитанные подмассивы не считать дважды
    
    Давайте распишем теорию
    Итак, распишем определения
    Пусть есть массив A, с нумерацией элементов от 0 до |A|-1, 
    За p = (i, j) - обозначим пару индексов, таких, что j > i
    p_i = i, p_j = j - проециями на составляющие пары
    Назовем функциями:
    L_i(p) - количество элементов arr[k], k < i, arr[k] > arr[i]
    C_i(p) - количество элементов arr[k], i < k <= j, arr[k] > arr[i]
    R_i(p) - количество элементов arr[k], k > j, arr[k] > arr[i]
    L_j(p) - количество элементов arr[k], k < i, arr[k] > arr[j]
    C_j(p) - количество элементов arr[k], i <= k < j, arr[k] > arr[j]
    R_j(p) - количество элементов arr[k], k > j, arr[k] > arr[j]
    Также назовем отдельно функцию L(x) = |{x: k < x, arr[k] > arr[x]}|
    (Мне было лень ранние функции переназывать иначе)
    Итак, суть задачи - найти все такие массива (1, 2, ..., n),
    для которых M = sum_{i=0}^{n-1}(L(i)) == k
    Итак свойства касательно выше ведённых функций:
    L_i(p) <= i >= L_j(p)
    C_i(p) <= j - i >= C_j(p)
    R_i(p) <= n - j - 1 >= R_j(p)

    Допустим мы хотим переставить (i, j) местами
    Тогда 
    L(i) := L(j) - C_j(p)
    L(j) := L(i) + C_i(p)
    когда меняем i и j местами, то

    3 2 5 1 6 4 7 8
    p = (2, 7)
    C_i(p) = 4
    T_i(p) = ~C_i(p) = 1
    C_j(p) = 0
    ~C_j(p) = 5


    T_i(p) - количество элементов < arr[i],
    Если arr[j] > arr[i], то у нас +2 элемента будет => -1
    Если arr[j] < arr[i], то у нас -2 элемента будет => +1
    M := M + C_i(p) - C_j(p) - T_i(p) + T_j(p) - (arr[j]-arr[i])/|arr[j]-arr[i]|
    M := M + 2*C_i(p) - 2*C_j(p) - (arr[j]-arr[i])/|arr[j]-arr[i]|
    M = 6 + 8 - 0 - 1 = 13
    j - i = 5
    M = 1(2) + 3(1) + 2(4) = 6
    3 2 5 1 6 4 7 8
    M = 1 + 3 + 2 = 6
    3 7 5 1 6 4 2 8
    1 + 3 + 1 + 3 + 5 = 13

    M = 1(5) + 3(1) + 1(6) + 3(4) + 5(2) = 13

    1 2 3 4 5 6
    M = 0
    p = (2,5)
    C_i(p) = 3
    C_j(p) = 0
    M = 0 + 6 - 1 = 5
    1 5 3 4 2 6
    1(3) + 1(4) + 3(2) = 5

    Итак, формулу обновления M для смена текущей пары p = (i, j) вывели:
    M := M + 2*C_i(p) - 2*C_j(p) - (arr[j]-arr[i])/|arr[j]-arr[i]|
    
    И как нам это помогло?

    Допустим мы будем только менять местами соседние значения массиваа

    Тогда у нас меняется M всего на 1 значение


    */
    return 0;
}