#include <iostream>
#include <stack>


/*
    Рекурсивный алгоритм
    f(n) = (f(n-2)) || f(n-2)() || ()f(n-2)
    Проблема - могут дублироваться случаи ()() и ()()

    Итеративный алгоритм
    1)Берем std::string
    2)Берём 2 итератора - начало или конец
    Делаем
     начало != std::next(конец)
        сохраняем CENTRE в стек
     пишем результат
     делаем
        если э

    Решение проблемы
    Если (n1 == 0)
        f(0, n2) = n2x')'
        выход
    иначе Если (n1 < n2)
        f(n1, n2) = '('f(n1-1, n2) || ')'f(n1, n2 - 1)
    Иначе Если (n1 == n2)
        f(n1, n2) = '('f(n1-1, n2)
    f(0, n) = ')'f(0, n-1)

    Вызов f подразумевает - обновление позиции вправо и сохранение в стеке (n1, n2) (сохраняем в стек LEFT или RIGHT)
    Выход из f подразумевает - обновление позиции влево и возвращение из стека (n1, n2) (выбрасываем из стека последний элемент, )
*/

enum Operation {
    LEFT = '(',
    RIGHT = ')'
};

int main(void) {
    unsigned int N = 0, left_N = 0, right_N = 0;
    std::cin >> N;
    left_N = right_N = N;
    N = 2 * N;
    std::string output;
    std::stack<Operation> stack;
    output.resize(N);
    std::fill(output.begin(), output.end(), 'a');
    auto pos = output.begin();
    /*
    Если (n1 == 0)
        f(0, n2) = n2x')'
        выход
    иначе Если (n1 < n2)
        f(n1, n2) = '('f(n1-1, n2) || ')'f(n1, n2 - 1)
    Иначе Если (n1 == n2)
        f(n1, n2) = '('f(n1-1, n2)
    f(0, n) = ')'f(0, n-1)

    f(n1, n2):
        Если (n1 == 0)
            заполнить после позиции pos ')';
        Если (n1 < n2)
            сначала
                *pos = '('
                Вход g(n1, n2, LEFT)
                Выход g(n1, n2, LEFT)
            после
                *pos = ')'
                Вход g(n1, n2, RIGHT)
                Выход g(n1, n2, RIGHT)
        Если (n1 == n2)
            *pos = '('
            Вход g(n1, n2, LEFT)
            Выход g(n1, n2, LEFT)
    
    Итак, как заменить рекурсивый алгоритм на итеративный ?

    сначала - сохранить в стек LEFT операцию
    после - сохранить в стек RIGHT операцию
    вернуть - сбросить из стека операцию
    Сначала выполняется сохранение скобочки в позицию
    Потом выполняется f->
    Потом вернуть - сброс
    На моменте
    Вызов f подразумевает - обновление позиции вправо и сохранение в стеке (n1, n2) (сохраняем в стек LEFT или RIGHT)
    Выход из f подразумевает - обновление позиции влево и возвращение из стека (n1, n2) (выбрасываем из стека последний элемент, )
    */
    bool onEnter = true;
    unsigned int level = 0;
    do {
        if (onEnter) {
            //Вход функции
            if (left_N == 0) {
                std::fill(pos, output.end(), ')');
                onEnter = false;
                //Выход функции
            } else if (left_N < right_N) {

            }
        } else {
            while (!stack.empty() && stack.top() == RIGHT) {
                stack.pop();
                pos--;
                right_N--;
            }
        }
    } while (level > 0);
    return 0;
}