#include <iostream>
#include <vector>

/*
Итак, на полу может быть не более K машинок
всего N машинок
У нас дана последовательность, в которой Петя захочет поиграть в машинки
Итак, создаем массив, в котором будет записан индекс когда будет использоваться последняя машинка
И массив который записывает индекс следующей машинки, в которую Петя ещё не играл
Если индекс текущей машинки последний, тогда меняем старую машинку на новую
Иначе если индекс текущеё машинки первый, тогда 
    Если количество занятых мест < K:
        То берём машинку из полки
    Иначе если количество занятых мест == K:
        То меняем на машинку, которая будет использоваться как можно позже.
        
*/

int calculateOperations(const std::vector<int> &operations, int N, int K, int P) {

}

int main() 
{
	int N, K, P;
    std::vector<int> operations;

    std::cin >> N >> K >> P;
    operations.resize(P);
    for (auto &element : operations) {
        std::cin >> element;
    }

	return 0;
}