#include <vector>
#include <iostream>

#define MAX_ARRAY_SIZE 1000000

std::vector<unsigned long> find_x_array(const std::vector<unsigned int> &arr, unsigned int n, std::vector<unsigned long> &result) {
    /*
    Итак, для каждого x от 0 до n-1 нужно найти максимально возможное min(a1) + min(a1, a2) + ... + min(a1,a2,...,an).
    Для каждого x можно применить к массиву максимум 1 раз операцию a_i = a_i + a_j, a_j = 0, стоимость операций = j - i,
    для каждого x стоимость операций должна быть минимум x
    Для каждого x применение операций производится независимо

    Итак, как найти максимальное значение суммы минимумов?
    Итак, эвристические идеи
    1)суммировать максимум с минимумом слева
    2)после суммирование следующие после j-го минимума будут 0-ми в любом случае
    
    Исходя из свойства 2) лучше выбрать j-й элемент как можно правее

    3)Если взять максимум и подставить в a1, то min(a1) может вырасти сильно
    Если максимум подставить в ai, i > 1, то все min до i-1-го элемента min не изменятся, а min_i = min_i-1
    Но это сработает только в случае, если max_j > min_{i-1} и если j > i

    4)Допустим у нас есть какой-то минимум слева, мы можем его увеличить до значений следующего минимума, тогда каждый следующий min будет увеличен на это приращение

    Тогда следующее
    для каждого i-го значения сохраняем префиксы -позиции первого и второго min, и суффиксы - сумму всех последующих элементов массива начиная с i
    
    (отдельно надо рассмотреть случай i = 1, потому что min только 1)
    Тогда получается 2-й цикл - для каждого i просматриваем значения j с конца, находим первое j: a_j - a_i >= x, такое, что min по максимуму обновляются
    С учетом количества запусков явно и здесь как-то нужно ускорить
    В тегах указано использование бинарного поиска
    Как можно использовать бинарный поиск?
    Итак, нам выгодней найти самое правое j
    и найти такое i - первого минимума, чтоб до "нулевого" минимума значения суммы увеличись бы на std::min(a[j]-a[i], a[second_min]-a[i]);
    нулевой минимум - это такой минимум для которого предыдущий минимум это второй, бля, что я пишу
    Таким образом в начале мы имеем первые 2 мин с расстоянием 1
    ищем пары минимумов с наибольшим промежуточным расстоянием
    а справа такой максимальный элемент такой, что 

    Предположительное ограничение sum + (right_min - left_min) * std::min(a[j]-a[left_min], a[left_min+1]-a[left_min]) - suffix[j] > sum
    Верхнее выражение неправильное, если a_i является минимумом (1-м), то оно не должно быть больше предыдущего минимума (2-го), тогда до следующего минимума (0-го) все вычисляемые минимумы увеличатся на std::min(a[j]-a[min_1], a[min_2]-a[min_1])
    sum + (min_0 - min_1) * std::min(a[j]-a[min_1], a[min_2] - a[min_1]) - suffix[j] > sum
    (для min_1 = 0 отдельный случай, там верхняя формула не работает, нужно искать позицию min_2, min_1 < min_2 < min_0, если min_0 - min_1 > 1, 
    тогда sum + (min_0 - min_1) * std::min(a[j]-a[min_1], a[min_2] - a[min_1]) - suffix[j] > sum,
    если min_0 = min_1 + 1, то sum + (a[j]-a[min_1]) - suffix[j] > sum)
    Вроде верно
    следующий минимум - это первый минимум, который >= предыдущего (a[min_{t-1}] >= a[min_{t}]), нумерация у меня запутанная в обратную сторону идет
    //TODO: Надо ещё разобрать случай, когда min_1 < j <= min_0
    Итак, если подумать про бинарный поиск:
    Ну допустим, слева минимумы будут убывать, но промежутки нет,
    сумма минимумов  будет выглядеть как a_1*c_1 + a_2*c_2 + ... + a_k*c_k - где k - номер последнего минимума до j
    ещё одно условие, если текущий минимум будет удален, надо будет до следующего минимума найти новый текущий минимум (то есть между min_1 и min_0, найти min_1_2: a[min_1_2] < a[min_2], в ином случае взять за
    справа сумма минимумов будет возрастать
    Например можно сразу найти вычислять максимальную прибавку от изменения минимумов, и максимальную разницу от "прибавляемых" суффиксов (разница в большинстве случаем наверняка будет отрицательной)

    Итак, простой вариант решения задачи
    1)Заполняем сначала префиксы минимумов (текущий, предыдущий и "второй" минимум и текущую аккумулируемую сумму))//TODO: Надо подумать
    пусть
    Вычисление текущих и предыдущих
    unsigned int minimum = a[0], accum = minimum, base = 0;
    prefix_min_i[0] = 0;
    for (std::size_t i = 1; i < a.size(); ++i) {
        if (a[i] <= minimum) {
            prefix_min_i[i] = i;
            prefix_prev_min[i] = minimum;
            prefix_prev_min_i[i] = prefix_min_i[i-1];
            prefix_next_min_i[prefix_prev_min_i[i]] = i;
            minimum = a[i];
        } else {
            prefix_min_i[i] = prefix_min_i[i-1];
            prefix_prev_min[i] = prefix_prev_min[i-1]; 
        }
        accum += minimum;
    }
    base = 0;
    for (std::size_t i = 0; i < n; ++i) {
        suffix[i] = accum - base;
        base += a[prefix_min_i[i]];
    }
    
    Давай посмотрим на префиксные деревья или деревья Фенвика
    Давай представим 2 такие структуры - одна хранит в себе отрезки между следующим и предыдущим минимумо
    Итак, мы в принципе можем хранить найденные интервалы в каком-то дереве
    Итак, новая идея - мы ищем первичные минимумы. Первичные минимумы идут слева направо в порядке убывания, предыдущий >= следующего
    Далее ищем вторичные верхние границы,
    вторичные минимумы - по свойствам то же самое, что и первичные минимумы, но ищутся в интервалах между предыдущим и первичным минимумом
    также, предыдущий до предыдущего первичного минимума формирует верхнюю границу вторичных мининимумов
    строим дерево, где узлы - это интервал от первичного минимума до вторичного (или вообще до следующего первичного)
    если текущий узел имеет "условный переход", типа интервал пересекается с j, то вычисляем частичный интервал и сравниваем предыдущий
    поиск в дереве осуществить по следующему принципу, если следующий элемент
    Там в решении используется максимум справа в качестве суффикса, а не сумма
    */
    return result;
}

int main(void) {
    unsigned int t = 0, n = 0;
    std::vector<unsigned int> a;
    std::vector<unsigned long> result;
    a.reserve(MAX_ARRAY_SIZE);
    result.reserve(MAX_ARRAY_SIZE);
    std::cin >> t;
    for (;t;--t) {
        std::cin >> n;
        a.resize(n);
        result.resize(n);
        for (auto &element : a) {
            std::cin >> element;
        }

    }
}