#include <iostream>

/*
Дано s - массив из следующих элементов:
-1 - значение в чёрной ячейке может быть любое (от 0 и более)
x - фиксированное число от 0 до n-1

Итак, допустим, есть s
-1 -1 -1 -1 s_i, -1, ..., s_j,..., -1 -1 -1 -1

Свойства:
1)Приоритет среди ближайших черных в порядке возрастания счетчика, сначала с большим значением, потом с меньшим
2)Каждую секунду только 1 элемент окрашивается
3)Начиная со второй секунды счетчик черных закрашенных элементов окрашивается
4)Особенность задачи заключается ещё и в том в какой момент начать элемент окрашивать, очевидно, что количесто оставшихся секунд должны быть ограничены n - i <= a_r
Рассмотрим ситуацию:
Допустим у нас 3 элемента a_i, -1, ..., -1, a_j, -1, ..., -1, a_k
между a_i и a_j количество отрицательных значений t_{ij} = j - i - 1, 
между a_j и a_k количество отрицательных значений t_{jk} = k - j - 1

Рассмотрим задачу f(i, j), определяющую, индекс какой ячейки - i или j - будет выбран при помощи p_r. 
между a_i и a_j количество отрицательных значений t_{ij} = j-i-1;
допустим мы берём какой-нибудь индекс r между i и j, тогда получаем
окрашиваем a_r, 
если |j - r| <  |r - i|, то s_j++;
если |j - r| >= |r - i|, то s_i++;
Далее после такого дробления рассматриваются 2 получившиеся подзадачи:
f(i, r) и f(r, j)

Попробуем внезапно представить эту задачу как задачу CSP:
1)Переменные это X = {x_1, ..., x_n}, x_i = p_i, x_i - это номер ячейки, которая будет окрашена в черный цвет на i-й секунде
2)Домены - D = {D_1, ..., D_n}, D_i = {1, 2,...,n}
3)Ограничения следующие:
C1)allDifferent(X)
C2)"ослабленное интервальное ограничение" - допустим, нам известно, что s_i положительно, 
значит справа и слева от него должны быть до этого окрашены в белый цвет 2^{k+1}-2 и 2^{(s_i)-k}-1 клеток слева и справа соответственно, где k любое число от 0 до s_i.
C2.5)Если s_i - самая левая (или самая правая) из известных s_i точка, то слева от неё для получения значения k должно быть w_k >= 2^k-1, (а справа соотвтественно w_k >= 2^{k-1})
//TODO: C2 и C2.5 при доказательстве как раз выводят порядок обхода
C3)Основана на C2, только между двумя известными s_i и s_j, а именно:
Пусть у нас есть частичное решение partial(X_{1...t}) = (x_1, ..., x_i, ..., x_j, ..., x_t) и для него выполнены следующие условия:
1)(порядок следования x_i и x_j в partial(X) неважен
2)x_j < x_i 
3)пересечение(partial(X), {x_r: x_j < x_r < x_i}} = 0 (то есть в частичном решении отсутствуют элементы располагающиеся между x_i и x_j)
4)известны k_j и t_i - значения, на которые должны увеличиться счетчики c_j и c_i за счет белых клеток между j и i,
5)Существуют такие первые x_h и x_h1, h1 > h > t,  для которых удовлетворяется одна из двух систем условий:
Система 1 (x_h - клетка, выбор которой увеличвает c_i, x_{h1} - клетка, выбор которой увеличивает c_j):
x_h > x_j + (x_i-x_j-1)/2 + (x_i-x_j-1)%2
x_h < x_i - w_{k_i-1}
x_h1 <= x_j + (x_h-x_j-1)/2 + (x_h-x_j-1)%2
x_h1 > j + w_{t_j-1}
Система 2 (x_h - клетка, выбор которой увеличвает c_j, x_{h1} - клетка, выбор которой увеличивает c_i):
x_h <= x_j + (x_i-x_j-1)/2 + (x_i-x_j-1)%2
x_h > x_j + w_{t_j-1}
x_h1 > x_h + (x_i-x_h-1)/2 + (x_i-x_h-1)%2
x_h1 < x_i - w_{k_i-1}
Тогда можно найти такие перестановки, чтобы оно удовлетворяло условиям в этом промежутке. 
Поиск дальнейших подходящий x_r для x_i и x_j производится относительно h и h1 при помощи C2 (C2 решается рекурсивно)
C4)Допустим s_{x_1} = 1 - тогда точки можно размещать только с 1 стороны от неё, а это возможно только если x_1 принимает значения из множества {1, n}!!!!!,
В случае если x_1 not in {1, n}, то s_{x_1} = 2 как минимум 
В случае, если n = 1, то s_{x_1} = 0
Также s_{x_n} = 0;
C5)//TODO: Тут надо определить, какие точки нужно выбрать начальные (то есть при i = 1, 2, 3, ...), потому что ближайшая черная точка может быть иногда только 1
C6)//TODO: На основе C2,C3,C4 нужно определить возможный порядок обхода.
пусть ч

Возможные методы решения:
D1)Первым делом надо выбрать первую черную точку (x_1), где s_{x_1} может быть как известное, так и неизвестное.
D1.1)Допустим s_{x_1} - известно, тогда мы просматриваем возможные варианты диапазонов lw_k и rw_{s_{x_1}-k} для разных k, находим такие
диапазоны, чтобы подходили под другие известные s_{x_i}. Если таких диапазонов нет, значит, наверное,  построить перестановки невозможно
А как сравнивать диапазоны?
Возможно нам стоит рассматривать только 


В принципе, для алгоритма думаю достаточно C1-C4
Алгоритм вычисления количества перестановок:
1)Итак, выбираем известные позиции s_i
Допустим мы идем по 


Доказательства (вместо x_i использовал i)
-------------Доказательство C2----------------
1)допустим мы установили x_i - клетка на i-й позиции стала черной, пусть r1 - количество белых клеток слева до предыдущего чёрного закрашенного элемента на j-й позиции
тогда, для того, чтобы увеличить счётчик на i-й позиции мы должны выбрать такой индекс h, чтобы |i-h| < |h-j|, в ином случае будет увеличен счётчик на j-й позиции.
i - h < h - j
i+j < 2h
(i+j)/2 < h
перенося неравенство на множество целых чисел, получаем следующее неравенство:
(i+j)/2 + (i+j)%2 < h
min{h} = j + (i - j - 1) / 2 + 1 + (i - j - 1) % 2 (это если i > j + 2, иначе нельзя)
Пример 1:
x_j, _, _, _, _, x_i
           ^
           h подходит начиная с этого места,
Пример 2:
x_j, _, _, _, _, _, x_i
              ^
              h подходит начиная с этого места

2)Далее, продолжаем решать задачу рекурсивно, увеличивая каждый раз счётчик, принимая j за h, и выбирая новую h;
3)Однако в любом случае, когда значение счетчика c_i = s_i - 1 (остается 1), то в конце должно оставаться как минимум 2 клетки, и нужно выбрать правую
x_j, _, _, x_i
        ^
        h
В случае если всего одна белая клетка клетка, то h выбрать нельзя
таким образом:
Значение  |  w количество необходимых белых клеток слева
0         |  0
1         |  2  x_j, _, h1, x_i   
2         |  6  x_j, _, _, _, h2, _, h1, x_i
3         |  14 x_j, _, _, _, _, _, _, _, h3, _, _, _, h2, _, h1, x_i
k         |  (w_{k-1} + 1)*2 = 2 * (w_{k-1} + 1) = 2 * (w_k)
короче ошибся, для получения k очков слева нужно как минимум 2^{k+1}-2
(2^{k}-2 + 1)*2 = (2^{k}-1)*2 = 2^{k+1} - 2 - доказано по математической индукции
2^{1+1}-2 = 2
2^{2+1}-2 = 6
Короче угадал слева должно быть !!!!2^{k+1}-2!!!! белых клеток как минимум



Теперь справа:
Значение  |  w количество необходимых белых клеток
0         |  0
1         |  1  x_i, h1, x_j
2         |  3  x_i, h1, h2, _, x_j
3         |  7  x_i, h1, h2, _, h3, _, _, _, x_j
...
t         |  w_{t-1} * 2 + 1
Тогда w_t = 2^t - 1 белых клеток
2^0 - 1 = 0
2^1 - 1 = 1
2^2 - 1 = 3
(2^{t-1} - 1)*2 + 1 = 2^t - 2 + 1 = 2^t - 1 - доказано по индукции, подставляем в t = s_i - k - количество необходимых значений для счётчика получаемых справа от i-й черной клетки
---------------------------Конец доказательства-----------------------------
---------------------------Доказательство C2.5--------------------------------
1)Пусть s_i - самое левое известное значение, составим таблицу
Значение  |  w количество необходимых белых клеток
0         |  0 x_i
1         |  1 x_h1, x_i
2         |  3 x_h2, _, x_h1, x_i
3         |  7 x_h3, _, _, _, x_h2, _, x_h1, x_i
...
t         |  2^t-1 - лол, это как в правом случае C2, но теперь слева...
для уточнения индексы идут в следующем порядке по времени:
i < h_t < ... < h_3 < h_2 < h_1
Итак, слева минимум должно быть w_t = 2^t-1 белых клеток
2)Пусть s_i - самое правое известное значение, вычисляем также
Значение  |  w количество необходимых белых клеток
0         |  0 x_i
1         |  1 x_i, x_h1
2         |  2 x_i, x_h1, x_h2
3         |  4 x_i, x_h1, x_h2, _, x_h3
...
k         |  2^{k-1}
для уточнения индексы идут в следующем порядке по времени:
i < h_k < ... < h_3 < h_2 < h_1
Итак, справа минимум должно быть w_k = 2^{k-1}
---------------------------Доказательство C3--------------------------------
x_j, _, ..., _, x_i,
Итак, пусть для x_j нужно увеличить счетчик на значение t_j, тогда количество необходимых белых клеток справа по C2 должно быть w_{t_j} = 2^{t_j}-1,
            для x_i нужно увеличить счетчик на значение k_i, тогда количество необходимых белых клеток слева по C2 должно быть w_{k_i} = 2^{k_i+1}-2
Итак, допустим, мы решили в начале увеличить счётчик x_i, тогда i - j = w_{k_i} + 1 = 2^{k_j+1}-1
Это из C2:
min{h_i} = j + (i - j - 1) / 2 + 1 + (i - j - 1) % 2 (это если i > j + 2, иначе нельзя)
min{h_i} = j + w_{k_i} / 2 + 1 + w_{k_i} % 2;
в случае, если h < h_i, увеличиться счётчик x_j, при этом h должна удовлетворять следующему условию h < i - w_{k_i}, иначе счётчик x_i невозможно будет увеличить слева на значение k_i
то есть в более общем случае у нас система 1 (в случае, если в начале прибавляем очко j-го счётчика): 
h > j + (i-j-1)/2 + (i-j-1)%2
h < i - w_{k_i-1}
тогда очко будет удовлетворено слева
Тогда берём h1
h1 <= j + (h-j-1)/2 + (h-j-1)%2
h1 > j + w_{t_j-1}
Система 2:
h <= j + (i-j-1)/2 + (i-j-1)%2
h > j + w_{t_j-1}

h1 > h + (i-h-1)/2 + (i-h-1)%2
h1 < i - w_{k_i-1}

Вывод C3:
Система 1 (h - позиция,):
h > j + (i-j-1)/2 + (i-j-1)%2
h < i - w_{k_i-1}
h1 <= j + (h-j-1)/2 + (h-j-1)%2
h1 > j + w_{t_j-1}
Система 2:
h <= j + (i-j-1)/2 + (i-j-1)%2
h > j + w_{t_j-1}
h1 > h + (i-h-1)/2 + (i-h-1)%2
h1 < i - w_{k_i-1}

Какой же у меня в голове дурдом, я тут использовал очень некорректные обозначения вопреки установленным ранее обозначениям
Мне лень переписывать доказательство с корректными формулировками

-------------------Исследование C4-----------------------------
Итак, 
i = 0, черных ячеек нет, массив счётчиков состоит из нулей, массив цветов выглядит чёрным
i = 1, x_1 = p_1, массив счётчиков состоит из нулейб массив цветов - белый, но на позиции p_1
i = 2, x_2 = p_2, массив счётчиков в любом случае увеличится только на позиции p_1, чёрным окрасится p_2
Теперь у нас 2 чёрные точки, одна уже имеет 1, другая 0
Рассмотрим кое-какие случаи
1)Допустим s_{x_1} = 1 - тогда точки можно размещать только с 1 стороны от неё, а это возможно только если x_1 принимает значения из множества {1, n}!!!!!
Если x_1 not in {1,n}
2)Какие максимальные значения могут принимать s_{x_i}?
Думаю, максимальное значение s_{x_i} может принять в случае если i = 1, и, рассмотрим свойства C2.5:(количество белых клеток слева и справа должно быть lw_k = 2^k-1, rw_k = 2^{k-1})
Тогда s_{x_i} = max{k+t}, при таких значениях lw >= 2^k-1 и rw >= 2^{t-1}, 2 =< k+t <= n-1 (k + t >= 1, только если x_i in {1,n}, при этом либо k = 0, либо t = 0)
k + t = n - 1 возможно достигнуть только в случае n = 2, 3,
n = 2   :  1, 2
           1, 0
n = 3   :  1, 3, 2
           2, 0, 0
n = 4   :  3, 1, 4, 2
           0, 3, 0, 0
n = 5   :  1, 0, 3, 0, 0 - при n = 5, max{s} = 3
n = 6 -> max{s} = 4
           2, 1, 5, 4, 6, 3
Ну, в-общем мы уже определили как искать максимальное значение s_{x_i}, в случае, если такое значение меньше текущего, то таких перестановок не существует
3)

------------------Исследование C5-------------------------------
Итак, у нас при установки каждой из следующих точек может быть 1 из ситуаций



Итак, примерный алгоритм
1)Нужно определить возможные чередования известных s_{x_i} точек (то есть последовательности x_{i1}, x_{i2}, x_{i3}, конечное значение счётчиков в которых нам изестны), 
где между соседними черными точками (такими точками, между которыми ранее не было чёрных клеток), выполнялись C2, C2.5, C3
Эти последовательности изначально определяют начальные значения счётчиков
//TODO: Надо также установить ограничения на максимальное значение белых клеток в случае k,t in {0, 1} nlw_k = любой (пример x_i, x_h, x_j, c_{x_j} = 0), nrw_k = 0 (то есть справа уже должно быть всё черно)
2)Далее, между "соседними" (между ними только белые клетки) точками мы определяем возможные k и t
i < j < h_{i1} < h_{i2} < h_{i3} < h_{} 

*/

#include <vector>

unsigned int find_permutations_count(const std::vector<unsigned int> &s, std::size_t n) {
}

#define MAXIMUM_COUNT 10000000
int main(void) {
    //TODO: Нужно найти, сколько таких перестановок p = [p_1, ..., p_n]
    std::size_t t = 0, n = 0;
    std::vector<unsigned int> s;
    s.reserve(MAXIMUM_COUNT);
    std::cin >> t;
    for (; t; --t) {
        std::cin >> n;
        s.resize(n);
        for (auto &element : s) {
            std::cin >> element;
        }
    }
    return 0;
}