#include <iostream>



int main(void) {
    int N = 0, t = 0;
    /*
    1-я задача - можно удалять из ai 2 и прибавлять к aj 1, после каждой операции числа не должны быть отрицательны
    Как решить задачу
    Самый простой вариант - это просто брать любой элемент и удалять из него двойки (мы смогли сделать столько-то операций первого типа)
    Итак храним 2 индекса - первым ходим по текущим элементам, второй 
    Самое простое - сортируем массив по четности и нечетности
    Затем проходимся по всем чётным массивам и 
    */
    return 0;
}