#include <iostream>

int main(void) {
    std::size_t T = 0, N = 0, M = 0, K = 0;

    std::cin >> T;
    for (std::size_t i = 0; i < T; i++) {
        std::cin >> N >> M >> K;
        auto l1 = K / N + (K % N != 0);
        auto l2 = M - l1;
        if (l2 < l1) {
            std::cout << l1 / (l2 + 1) + (l1 % (l2 + 1) != 0) << std::endl;
        } else {
            std::cout << 1 << std::endl;
        }
        /*
        Итак, мы должны максимально равномерно распределить в каждой строке
        l1 = K / N;
        d = K % N;
        for (unsigned int)
        l2 = l1 + 1
        a1 = N - d
        a2 = d
        Имеется строка из l2 элементов
        Далее у нас имеется строка такого вида
        1111111..1 00000000
        1
        10
        11
        100
        110->101
        111
        1000
        1100
        1010
        1110 -> 1011
        11110 -> 11011
        111110 -> 110111
        1111100 -> 1101101
        l2 из M элементов являются 1-цами
        Если M2 - l2 >= l2
        Тогда 1
        Иначе l2 / (M2 - l2 + 1) + (l2 % (M2 - l2 + 1) != 0)
        */
    }
    return 0;
}