#include <vector>

class Solution {
public:
    std::vector<int> earliestAndLatest(int n, int firstPlayer, int secondPlayer) {
        /*
        Итак, игра такая в каждом раунде каждый i-й дерется с каждым n-i-м игрок
        Нужно найти [минимальное, максимальное] количество раундов, после которых первый и второй игрок точно встретятся
        В каждом раунде победителя можно выбирать любого

        Короче говоря, нам нужно создать 2 такие процедуры, при которых мы до талого выводим игроков в финал и 2-я процедура, которая сталкивает их как можно раньше
        Подзадача первая - найти минимальное количество раундов.
        Обозначим игрока first за x, second за y.
        Тогда в начале у нас x будет драться с n-x, y будет драться с n-y.
        и тогда слева от x будет <= x - 1 оставшихся участников
        Если слева от x будет участник который против y.
        
        */
    }
};