#include <vector>
#include <string>
#include <unordered_set>
#include <functional>

class Solution {
public:
    std::vector<std::vector<std::string>> deleteDuplicateFolder(std::vector<std::vector<std::string>> &paths) {
        /*
        Нужно удалить дублируемые пути в папках, я так понял там для этого просто должны быть равны последние папки
        папки дублируемые если они имеют схожый набор дублированных подпапок (то есть, если a/x, a/w, b/x, то x- дублируется, a и b не дублируются, если бы не a/w, то a и b бы дуюлировались)
        Итак,решаем задачу следующим образом
        1)Создаем дерево строк
        2)Далее, при помощи обхода в глубину вычисляем хэш каждого поддерева, в случае если такой хэш уже был вычислен, то помечаем поддерево как дублирующееся
        3)Далее при помощи обхода в ширину удаляем все поддеревья с помеченным 
        4)При помощи обхода в глубину создаем новый вектор строк

        1)Создание - дерева строк - можно каждую строку - храним отдельную хэш-таблицу и сохраняем в ней хэш
        
        Для каждого подмассива строк (пути):
            Для каждой строки в подмассиве:
                Просматриваем по каждому символу в дереве символов (trie), сохраняя текущий полиномиальный хэш
                Потом для новых символов на конце записываем новые значения полиномиального хэша
        */
        std::unordered_set<unsigned int, std::string> ret;
        for (const)
    }
};