#include <vector>

//TODO:
class Solution {
public:
    int punishmentNumber(int n) {
        /*
        Итак, мы должны найти сумму всех таких чисел i*i для i с 1 по n, таких, что сумма подчисел i*i = i

        Как это сделать?
        Есть число a1a2a3...,an
        умножаем число на себя
        Допустим если у i количество разрядов k, то количество разрядов i*i либо 2k(40*40 = 1600), либо 2k-1 (10*10 = 100)
        То есть мы допускаем, что как минимум у одного из-под чисел количество разрядов должно быть либо k, либо k-1 (например, хз, возможна ли такая ситуация, например a1a2a3^2 = b1b2b3b4b5b6, где b1b2+b3b4+b5b6=a1a2a3)
        
        */
    }
};