
//SUCCESS, 100%, 0ms, вроде простая задача, хоть и medium, думаю я многим бы проиграл на реально больших числах, представляемых в виде массивов...
class Solution {
public:
    int makeTheIntegerZero(int num1, int num2) {
        /*
        Итак, нужно узнать сколько минимально таких чисел i мы можем выбрать чтобы постоянно вычитая из num1 num2+2^i получить 0
        Иначе, вовзращаем 1 (не возможно)
        
        Итак, пусть m - количество таких операций
        тогда число num1 = m * num2 + (сумма из m степеней 2^k, или может быть даже меньше m(например 2^k + 2^k == 2^(k+1)))
        тогда решаем задачу иначе
        Ищем первую такую m начиная с 1, что l = num1 - m * num2 можно представить как сумму m или меньше степеней 2^k,
        при этом 
        1)l > 2^(m/2),
        2)l не должна иметь больше 1 в двоичном представлении, чем m

        m = 1
        l > 0
        l = 1, 2, 4,...

        m = 2
        l > 1
        l = 2,3,4,5
        наименьшее представление числа в качестве суммы степеней двоек есть её двоичное представление... (min(l) = количество 1 в двоичном представлении)
        а максимальное представление числа в качестве суммы степеней двоек есть её значение(max(l) = самое значение)
        поэтому m должно быть где-то между минимальным

        Как быстро определить количество единиц у числа?

        Наверное у этой задачи есть и более интересное решение
        Возможно даже используя двоичный поиск
        */
        if (!num1) {
            return 0;
        }
        if (num1 > num2) {
            constexpr int INT_BIT_COUNT = sizeof(int) * 8;
            long base = 0, min_l, max_l;
            for (int m = 1; m <= 64; ++m) {
                base += num2;
                max_l = static_cast<long>(num1) - base;
                if (max_l < 0) {
                    break;
                }
                min_l = 0;
                for (int i = 0; i < 63; ++i) {
                    if (max_l & (static_cast<long>(1) << i)) {
                        ++min_l;
                    }
                }
                if (m >= min_l && m <= max_l) {
                    return m;
                }
            }
        }
        return -1;
    }
};