#include <vector>

class Solution {
public:
    int numberOfPairs(std::vector<std::vector<int>>& points) {
        /*
        Дан массив точек в двумерном пространстве. надо найти количество таких пар точек p1, p2, что x1 >= x2, y1 <= y2, и в квадрате (или линии), 
        вершинами которого они являются, нет других точек из этого списка (то есть не сущестувет такой точки (x,y), что x1 >= x >= x2, y1 <= y <= y2).

        Так, ну допустим, сделаем такое предположение
        Назовем ранее выдвинутое ограничение C, и будем обозначать ограничение над парой точек обозначать (p1 C p2), а не существовние этого ограничения ~(p1 C p2)

        Лемма 1:
        если (p1 C p2) и (p1 C p3), то ~(p2 C p3) и ~(p3 C p2)
        Доказательноство:
        Допустим это не так,
        1)(p2 C p3) - истинно, тогда x2 >= x3, y2 <= y3
        но (p1 C p2) ==>  x1 >= x2, y1 <= y2
        тогда x1 >= x2 >= x3, y1 <= y2 <= y3 => ~(p1 C p3) - противоречие
        2)(p3 C p2) аналогично
        
        (Обобщение леммы 1):
        Пусть есть точка p1 и множество точек P, где для каждой p_i in P истинно (p1 C p_i), тогда для любых p_i, p_j \in P, i!=j истино ~(p_i C p_j).
        Доказательство - лемма 1
        
        Лемма 1.1:
        Если (p1 C p2) и (p1 C p3), то истинно:
        либо x2 < x3 и y2 < y3
        либо x3 < x2 и y3 < y2

        Лемма 2:
        ecли (p2 C p1) и (p3 C p1), то ~(p2 C p3) и ~(p3 C p2)
        Доказательство:
        Допустим, это не так
        1)(p2 C p3) - истинно, тогда x2 >= x3, y2 <= y3
        но (p3 C p1) ==>  x3 >= x1, y3 <= y1,
        тогда x2 >= x3 >= x1, y2 <= y3 <= y1 ===> ~(p2 C p1) - противоречие
        2)(p3 C p2) аналогично

        (Обобщение леммы 2):
        Пусть есть точка p1 и множество точек P, где для каждой p_i in P истинно (p_i C p_1), тогда для любых p_i, p_j \in P, i!=j истино ~(p_i C p_j).
        Доказательство - лемма 2

        Лемма 2.1:
        если (p2 C p1) и (p3 C p1), то истинно:
        либо x2 < x3 и y2 < y3
        либо x3 < x2 и y3 < y2

        Лемма 3: Если (p1 C p2) и (p2 C p3), то ~(p1 C p3), ~(p3 C p1) (можно обобщить на основе множеств P1 = {p_i: (p1 C p_i)} и P2 = (p_j: (p_j C p1)), тогда ~(p_i C p_j), ~(p_j C p_i))

        Лемма 4: Пусть есть точка p1 и множество точек P1 = {p_i: (p1 C p_i)}, пусть p_maxy in P1 - точка в множестве P1 с максимальной y, p_minx - точка с минимальной x соотвтетственно.
        И пусть существует точка p2, такая, что (p_maxy C p2) и (p_miny C p2). Тогда для любой точки p_i in P1 истинно (p_i C p2)
        Доказательство:
        Пусть для какой-нибудь p_i in P такое не выполняется, то есть существует какая-то точка p_j in P, что x2 <= x_j <= x_i, y2 >= y_j >= y_i
        из леммы 1.1 следует что для точек p_i и p_j относительно точки p1 истинно:
        либо x_j < x_i, y_j < y_i (не пересекается с ранними неравенствами)
        либо x_j > x_i, y_j > y_i (не пересекается с ранними неравенствами)
        отсюда следует, что либо p_j, либо p_i не принадлежат P, что противоречит условию леммы
        ЗАМЕТКА: ЭТА ЛЕММА ВЕРНА, ТОЛЬКО ЕСЛИ НЕТ НИКАКОЙ ПОСТОРОННЕЙ ТОЧКИ МЕЖДУ ТОЧКАМИ ИЗ P И p2
        
        Тогда алгоритм поиска таких пар следующий:
        Пусть есть начальное множество точек P
        1)сортируем элементы по возрастанию x и убыванию y и сохраняем в некоторое начальное множество точек A
        Ну или можно сохранить множество A как двумерный массив точек для каждого значения x
        2)Начиная со второй точки из A:
        Если предыдущая точка не подходит по значениям x и y, то идем дальше
        Если предыдущая точка подходит сравниваем её с верхней и левой допустимой границей (тут наверное нужно строить какое-нибудь дерево)
            Если подходит - вставляем новую границу
                Если находится внутри какого-то уже определенного квадрата, то обновляем квадрат (удаляем старую вершину квадрата, а эту сохраняем как новую)
                Если находится снаружи и образуемый квадрат не пересекает ранее определенные точки, то строим новую точку с парой
                Иначе оставляем точку в изначальном множестве
            Иначе оставляем точку в изначальном множестве

        
        
        Из-за изначальной сортировки нет смысла использовать дерево или какую-то иную структуру,
        достаточно иметь верхнюю границу для y (up_y) и верхнюю границу для x (up_x), и фиксированную нижнюю границы down_y
        каждый раз, когда находим подходящую точку (x, y), где x < up_x, down_y <= y < up_y, удаляем точку из множества и добавляем в множества подточек данной точки
        Далее обновляем up_y = y, up_x = x и продолжаем точку 
        Если x, y не подходит, то смотрим какие из её подточек подойдут в качестве пары для p
        для быстрого определения какие подточки можно использовать можно хранить какую-то специальный тип данных или использовать 2-ый поиск
        Помимо этого мы также храним для каждой точки p1 множество подточек P, такие что (P C p1), тогда можно не проверять (p C P) в случае если (p C p1)
        какие есть для этого алгоритмы
        Наверное нужно всё-таки использовать какое-то дерево или даже декартово дерево
        */
    }
};