#include <iostream>
#include <vector>

//TODO: Доделать

class Solution {
    public:
        long long maximumValueSum(std::vector<int>& nums, int k, std::vector<std::vector<int>>& edges) {
            /*
            Дано дерево (неориентированное), где каждая вершина i содержит число nums[i], edges - ребра [u, v].
            При помощи специальной операции мы делаем xor на инцидентные вершины, то есть выбираем ребро [u, v] и nums[u] = nums[u] XOR k, nums[v] = nums[v] XOR k
            Какую максимальную сумму nums можно так получить засчет этих операций
            Итак, xor^2 k = I - идемпотентная операция, поэтому числа могут быть только в 2-х состояниях
            Я так понял эта задача на обход в глубину,
            Кладём начальную вершину (допустим 0-ю), помечаем её как используемую, кладём в стек
            Пока стек не пуст {
                Если среди соседних вершин есть неиспользуемая и непомеченная вершина:
                    Теперь эта вершина используемая, помечаем её как используемую
                    кладём её в стек
                    Продолжаем цикл заново
                Иначе:
                    помечаем вершину как запрещённую
                    в массив сумм добавляем это число
                    переходим в состояние возврата
                    Удаляем из стека вершину
                //Итак, надо догадаться, как совместить эти суммы чисел
            }
            */           
        }
    };