#include <vector>

class Solution {
public:
    std::vector<bool> getResults(std::vector<std::vector<int>>& queries) {
        /*
        //TODO:
        Итак, дана бесконечная прямая от 0 до бесконечности
        есть запросы 2-х типов:
        1)Запросы типа [1, x] - размещение препятствия на координате x
        2)Запросы типа [2, x, sz] - проверка, может ли быть блок размера sz клеток размещён где-то в диапазоне [0, x]
        Нужно вернуть массив истинности, что i-й блок можно вставить

        Итак, решение:
        Ну допустим мы отсортируем эти запросы типа 2 по возрастанию x, но вроде так делать нельзя, потому что порядок
        */
        
    }
};