#include <string>
#include <iostream>

//TODO: Доделать

//Мой любимый тип задач на LeetCode - задачи с непонятным условием и тестами, ну такими полезными, ахахах, задача про удаление звездочек, в качестве тестового примера берём строку в которой их нет
/*
Дана строка s, в которой возможно есть символы '*'.
Пока в строке есть символ '*':
Удаляется самая левая '*', а также удаляется минимальный (не '*'), слева от выбранной звездочки (я так понял это условие).
Нужно вернуть минимальную лексикографическую строку, получаемую при помощи этой операции...

...Ну, если есть минимальный элемент слева от любой звездочки, то он в любом случае будет удалён
   Доказательство:
   Пусть i1, i2 - координаты неких левой и правой звездочек i1 < i2, k1, k2 - индексы соответственных минимальных слева от i1,i2 незвёздочек s[k1], s[k2]
   Причем k1 <= k2, s[k1] <= s[k2]
   Предположим, что k2 > i1
   Тогда, допустим мы выбрали в начале звездочку i1, мы удаляем её и s[k1]
   Тогда останется i2 и k2, 
   Если же мы выберем i2 и k2, то останется i1 и k1 и возможно какой-то элемент j который находился между i1 и k2, такой что s[k1]>= s[j] >= s[k2]
   Ну вот

   Пример следующий 
   c*ba*
   Например, берём правую звездочку, получаем 
   c*ba* -> cb*-> b
   Берём левую звёздочку
   c*ba* -> ba*-> b
   cbcb*dba*
   Берём первую
   либо
   cbcb*dba* -> cbcdba* -> cbcdb
   либо
   cbcb*dba* -> ccbdba* -> ccbdb
   Берём 2-ю
   cbcb*dba* -> cbcbdb* -> cbcbd
   Так, ну, по идее нужно брать символы с последней звездочкой
   Так... ну и как это нам поможет?
   Основная суть заключается в том, что всегда желательно удалять символы как можно правее,
   Итак, как известно самые правые минимумы рано или поздно будут удалены по-любому
   поэтому каждый раз нам надо удалять как можно более правый символ, если возможно
   Итак, допустим выбираем
   Что можно делать - брать такую правую звезду, что при удалении первой звезды её минимум не теряется, и при этом минимумы
   Короче, нам в любом случае следует удалять самые правые минимумы
   Короче, напишу и проверю, какие тесты не сработают
   Вот контр-пример, где удалять надо вначале левую
   cbb*aa*
   Если брать первую:
   cbb*aa* -> cbaa* -> cba
   Если брать вторую:
   cbb*aa* -> cbba* -> cbb
   Итак, возможный критерий следующий
   Если при удалении более страшего лексикографического символа слева от звездочки его заменит символ лексикографически младше сразу после *, то мы удаляем его слева
   Если правый элемент будет удалён в любом случае, а после него идут более старшие символы, то выгоды в использовании первой звёздочки нет.
   Например в случае 
   cbb*aa* выгодней использовать сначала первую *, потому что тогда на место b встанет a
   cbcb*dba* выгодней использовать сначала вторую звездочку, в противном случае на место 2-й b встанет d

   Рассмотрим более сложный пример:
   cbb*aa*dc*
   Допустим мы в начале берём 1-ю звездочку
   cbaa*dc* -> в в любом случае, потому что все минимумы слева от первой звезды -> cbdc
   Допустим мы в начале взяли 2-ю звездочку
   cbba*dc* -> аналогично, все минимумы слева от первой звезды -> cbdc
   Если возьмем 3-ю звезду
   cbba*dc* -> cbbdc* -> cbdc
   Неудачный пример
   Допустим
   cbb*aca*adc*
   1)1-я звезда
   cbaca*adc* -> в любом случае -> cbacdc
   2)2-я звезда
   cbbac*adc* -> в любом случае -> cbbcdc
   3)3-я звезда
   cbbaca*dc* -> в любом случа -> cbbcdc
   оказалось, что самое выгодное сначала смотреть относительно первой звезды
   cbb*daca*adc*
   1)1-я звезда
   cbdaca*adc* -> в любом случае -> cbdacdc
   2)2-я звезда
   cbbdac*adc*-> в любом случае -> cbbdcdc - лексикографически меньше
   3)3-я звезда
   cbbdaca*dc*-> в любом случае -> cbbdcdc
   
   a1,a2,a3, ..., a_{k_1-1}, '*', a_{k_1+1}, ... ,a_{k_2-1}, '*', ...
   Ну допустим, если мы будем смотреть от самой правой звездочки (l-я звезда), то, если ближайший слева минимум от l-й звезды будет правее l-1-й звезды
   значит этот минимум будет удалён последней звездой 100%
   Если мыслить интуитивно, то для каждой звезды должен быть уничтожен максимальный минимум, да так, чтобы его место занял либо меньший минимум, либо такой же,
   либо меньший
   Так, ну, предположим алгоритм следующий (эвристический)
   f(s) {
   Итак для каждой звездочки (от 1-й до последней) ищем минимумы, которые будут удалены
   чем ближе минимум к звездочке, тем раньше он будет удалён, если это выгодно
   Допустим, можно сохранить все возможные удаления по принципу "сначала самый правый минимум" относительно текущей звездочки
   Желательно выбрать самую левую или правую звезду
   Если при удалении текущего символа строка гарантированно станет лексикографически меньше (то есть можно найти такую комбинацию звезд, что при удалении этого элемента будет гарантировано на этом месте стоять символ лексикографически <= тому что было)
   Например как в случае b*aa* - сначала берём первую звезду, потом последнюю
   В ином случае, если нет других таких же вариантов - удаляем самый правый минимум
   }
   Рассмотрим ещё более сложный пример

   Ну похоже на задачу для динамическго программирования
*/
/*
Напишем генератор
*/

#include <vector>
#include <random>
std::string generate_string(std::size_t size, std::size_t stars_count) {
    std::string str;
    str.resize(size);
    std::random_device rd;
    std::mt19937 mt(rd());
    std::uniform_int_distribution<> dist('a', 'z');
    for (auto &element : str) {
        element = dist(mt);
    }
    dist = std::uniform_int_distribution<>(0, size - 1);
    int i = 0;
    while (stars_count) {
        i = dist(mt);
        if (str[i] != '*') {
            str[i] = '*';
            stars_count--;
        }
    }
    return str;
}

//TODO: Далее, ищем полным перебором все варианты полученных строк и порядок их удаления


class Solution {
    public:
        std::string clearStars(std::string s) {
            
        }
    };