class Solution {
public:
    bool isPowerOfThree(int n) {
        if (n <= 0) {
            return false;
        }
        if (10460353203 % n) {
            return false;
        }
        return true;
        /*
        11
        11
        11
       11
      1001
        11
      1001
     1001
     11011
        11
     11011
    11011
   1010001
        11 - 1 = 10 (2)
        1001-1 = 1000 (8)
        11011-1=11010 (26 = 16 + 8 + 2)
        1010001-1=1010000
        3^x = (1+2)^x = 1 + C^{1}_{x} * 2 + C^{2}_x * 2^2 + ... + 2^x
        Свойства:
        1)число 3^x всегда нечётное
        1 2 3  4  5   6   7    8    9
        3,9,27,81,243,729,2187,6561,19683
        2)последняя цифра повторяется через каждые 4 степени
        3)при n = 1, сумма цифр = 3
          при 2 <= n <= 5, сумма цифр = 9
          при 6 <= n <= 8, сумма цифр = 18
          и тд...
        4)Если n = 3^x, то n не может делиться ни на какие простые числа, 2,7,11,13,17,19,23
        
        вернёмся к битовым представлениям:
        3 = 11
        3-1 = 10
        3+1 = 100

        9 = 1001
        9-1 = 1000
        9+1 = 1010

        27 = 11011
        27-1=11010
        27+1=11100

        xor
        11011
        11010
        00001

        11011
        11100
        00111

        3 = 11
        3+1 = 100
        xor = 111 - 7

        9 = 1001
        9+1 = 1010
        xor = 11

        27 = 11011
        27+1 = 11100
        xor = 111
        81 = 1010001
        81+1=1010010
        xor = 11

        4)Офигеть, вот это я случайно обнаружил прикол...
        типа переход 11 -> 1001 -> ...011 -> ..0001001 -> и так далее по циклу
        но это может быть не единственная последовательность такого вида, что 
        (p^x + 1) xor p^x = 3
        (p^{x+1}+1) xor p^{x+1} = 7
        (p^x + 1) xor p^x = (p^{x+2}+1) xor p^{x+2}
        допустим 10011 = 3 + 16 = 19 - тоже работает такое правило, значит число в любом случае должно делится на 3
        
        можно ли найти такое число, которе заканчивается на ...011, которое при умножении на себя даёт в конце ...1001 и при этом делится на 3, но не является степенью 3?
        Допустим, у нас есть 
        64 + 32 = 96 + 3 = 99 - делится на 3
        1100011 - срабатывает правило 4

        Значит нужно учитывать какое-то ещё ограничение

        попробуем ещё раз посмотреть степени 
        1            1
        3           11
        9         1001
        27       11011
        81     1010001
        243   11110011
        729 1011011001
        Допустим, если n = 3^x, то если x - четно, то sqrt(3^x) - тоже степень 3-ки...
        3^x - 3^{x-1} = 3^{x-1} * 2
        3^x - 3^{x-2} = 3^{x-2} * 8
        3^x -...

        1 2 3  4  5   6   7    8    9
        3,9,27,81,243,729,2187,6561,19683

        243 - 3 = 240 = 3 * 8 * 10 = 3 * 80
        729 - 9 = 9 * 80
        2160 = 80 * 27 = 

        f(n) = 3^{[log3(n)]} - n
        f(x) = 3^[x]     - n
        delta(3^x) = 2 * 3^{x-1}
        если n <= 0, то false,
        если n == 1, то true
        если n == 2, то false
        если n >= 3, то 
        3^x = (5 - 2)^x

        Короче решение такое - надо найти максимальную степень 3-ки - ведь на неё может делиться только степень 3-ки и через неё проверять
        */
    }
};