#include <vector>

//TODO: Я хз, это задача на динпрог, но тут переходы состояний взаимозависимы у разных игроков,

class Solution {
public:
    int maxCollectedFruits(std::vector<std::vector<int>>& fruits) {
        /*
        Дана матрица, где в каждой ячейке хранится fruits[i][j] фруктов
        Играют 3 ребенка, начинают с позиций (0,0),(0, n-1),(n-1,0)
        дети могут сделать исключительно n-1 ходов

        Первый менять координаты на следующие delta:(1,1),(1,0),(0,1)
        Второй:(1,-1),(1,0),(1,1)
        Третий:(-1,1),(0,1),(1,1)
        Найти максимальное количество фруктов которое могут собрать 3-е друзей вместе
        (После того, как игрок посетил клетку, она обнуляется)
        Так, и как решить...
        Особенности: 
        Первый ходит уголком, классическая задача, где муравей ходит в квадрате либо вправо либо вниз, остановится, когда врежется в стену
        Второй ходит либо вниз либо вниз по диагонали, он остановится врезвашись в нижнюю стену
        Третий ходит либо вправо, либо вправо по диагонали, остановится, врезавшись в правую стену
        Таким образом:
        Первый может посетить любую точку
        Второй может посещает только точки (i,j), где истино (n-1) - i <= j
          0 1 2
        0 0 0 1
        1 0 1 1
        2 1 1 1
        Третий аналогично
        Так, проблема следующая, они же могут посещать одни и те же точки

        Ладно сначала рассмотрим точки где (n-1)-i > j
        dp1[i][j] = max(dp[i-1][j], dp[i-1][j-1], dp[i][j-1]) + fruits[i][j];

        Далее мы же не можем в отдельности собирать dp касательно каждого игрока
        Прикол в том, что 2-й и 3-й игрок могут пересекаться, но смысла в этом нет, (или есть?)

        ИДЕЯ, МОЖНО ИСПОЛЬЗОВАТЬ ШТРАФЫ, ТО ЕСТЬ ОТРИЦАТЕЛЬНЫЕ dp, ТОЛЬКО КАК?
        (Это просто мысль, может можно как-то развить)
        Тут же явно 

        */
    }
};