#include <vector>
#include <string>
#include <stack>

//TODO: Решить
class Solution {
public:
    std::vector<std::vector<int>> supersequences(std::vector<std::string>& words) {
        /*
        Дан массив строк, нужно найти все минимальные SCS (это такие строки, которые содержат сами строки как подпоследовательности), 
        при этом эти SCS не должны быть перестановками друг друга
        SCS возвращаются в виде массива частот символов
        Дополнительное условие - длина слов всего 2 символа
        Итак, эта задача вроде как задача на граф
        
        Попробуем рассмотреть задачу так:
        у нас каждая строка - это набор точек из области помеченной i-м цветом, где i - положение строки в массиве
        Допустим, нам нужно найти такие подмножества этих точек.
        

        Итак, с учётом того, что вроде как символа всего 2, то задача становится похожа на поиск соответствующих пар,
        где выбирается пара символов при этом из вариантов убирается строка содержащие все такие символы в начале и в конце.

        Вообще, задача очень похожа на бектрекинг
        Переменные:
        Фиксированные переменные (для определения ограничений):
        Z = {Z_1, ..., Z_m}
        Z_j = (x_j, y_j) - пара символов из которых состоит строка Z_j.
        x_j, y_j in D.
        Искомые переменные:
        S = (s_1, s_2, ..., s_n), s_i in D.
        Домены:
        D_i = D = [a, z]
        Ограничения:
        C1)Для любой Z_j in Z в строке S должны найтись такие индексы p, q, что :
        1 <= p < q <= n
        s_p = x_j
        s_q = y_j
        С2)Допустим мы взяли какое-то фиксированное Z_j, где значение x_j = a. Найдем такое подмножество A in Z: A = {Z_j: x_j = a, Z_j != Z_k(без дублирования)}.
        Тогда в S должно найтись такое i: 1 =< i <= n - |A|, что s_i = a.
        Аналогично и в случае фиксации значения y_j = b. Находим такое подмножество B in Z: B = {Z_j: y_j = b, Z_j != Z_k (без дублирования)}.
        Тогда в S должно найтись такое i: |B| < i <= n, что s_i = b.

        Теперь переформулируем задачу в виде задачи о графе
        Пусть есть граф G = (V,E), где множество вершин V - это множество D - алфавит символов, E - множество дуг, каждая дуга описывает words[i],
        где words[i][0] - вершина из которой исходит дуга, words[i][1] - вершина в которую она входит 
        Нужно:
        Найти такие подразбиения G', в которых можно построить минимальный маршрут, который содержит в себе пути между каждыми парами вершин, инцидентными с каждым ребром e in E

        Какие алгоритмы можно использовать для поиска подразбиений?
        Ну тут явно чё-то на топологическую сортировку

        Допустим, мы берём вершину word[i][0] как первую вершину в списке
        Далее, определяем все вершины word[j][1], где word[j][0] == word[i][0].
        Строим отображение w_1->A={a_1, a_2,..., a_{r_1}}
        Далее, берём следующую вершину и определяем подмножество 
        w_2->B={b_1, b_2, ..., b_{r_2}}

        Итак, начало:
        S = ()
        K_1 = (w_1, comb_A) - где comb_A представляет построенную строку из элементов в A
        K_2 = (w_2, comb_B) - где comb_B представляет построенную строку из элементов в B
        Итак, в начале
        S = K_1 (в начале стоит символ w_1, за ним стоят символы из A),
        Допустим мы этого не знаем и уже имеем упорядоченный по старому набору символов

        Итак, я знаю что строка типа zyx...cbaabc...xyz - удовлетворяет всем возможным требованиям из words
        И нам по сути достаточно просто удалять избыточные отношения
        Допустим в начале мы отмечаем позиции, которые 100% ни на что не влияют
        допустим ab, ba -> мы должны получить aba и bab
        1)zyx...cbaabc...xyz
          000...011210...000
          получаем baab, где 2-ю a можно опустить
        2)abc...xyzzyx...cba
          110...000000...021
          получаем abba, где 2-ю b можно опустить
        
        Но как доказать или опровергнуть что мы можем просто так использовать такие базовые строки
        допустим ab,ac,bc,cb,ca,ba
            cbaabc
        ab    121
        ac    1211
        bc   11211
        cb  111211
        ca  111211
        ba  111211
        получаем cbabc
            abccba
        ab  110020
        ac  111220
        bc  111221
        cb  111211
        ca  111211
        ba  111211
        получаем abcba
        и по идее получаем bcacb
        abcba  
        cbabc
        cabac

        Допустим
        есть набор ab, ba
        делаем (b)ab(a)
        ab - гарантированно существует
        ab ba ac cb
        ab
        (b)ab(a)
        (b)acb(a)
        bacb
        acba
        ab ba ac cb bc
        ab
        (b)ab(a)
        (b)acb(a)
        (b)acb(c|~b)(a|~b)
        bacb
        acbca - не подходит
        bb ab ba ac cb
        bb
        abb
        (b)abb
        (b)acbb
        bacb - по идее дожно опять получиться

        bb ab ba ac cb
        ()b()b()
        (a_1)b(a_2|~a_1)b()
        (a_1)b(a_2|~a_1)b(a_3|~a_2)
        (a_1)(c_1|a_1)b_1(a_2|~a_1)(c_2|a_2)b_2(a_3|~a_2)(c_3|a_3)
        А вот как мы при обходе определим, что у нас гарантированно будет либо c_1 либо c_2?

        Далее при помощи модифицированного обхода в ширину ищем самые короткие строки и удаляем дубли
        acbbac
        bacb
    
        Итак, заново
        Пусть у нас есть изначальное множество непроверенных вершин A
        Выбираем некоторую вершину v_1
        Далее из words вычисляем 3 подмножества вершин
        U - подмножество вершин, где из каждой вершины u_i in U гарантированно существует ориентированный маршрут до v_1
        W - подмножество вершин, где для каждой вершины w_i in W гарантировано существует ориентированный маршрут от v_1
        V_1 = {v_1} множество текущих вершин ()
        Обновляем A = A - v_1
        множества вершин отсортировали следующим образом
        U->V->W

        Далее берём v_2 in A и из words
        1)Просматриваем...


        Ну или давайте посмотрим на задачу топологической сортировки
        представим, что у нас есть 'z'-'a'+1 проводов
        'a'---------'b'
        'b'---------'c'
        'c'---------'c'
        ...
        'z'----------
        Прям вроде как требуется алгоритм поиска в ширину, но с хранением пути


        Итак, алгоритм, основанный на стягивании вершин
        1)Строим граф на основе words, где вершины - символы, дуги - связь, означающая что после одного символа в строке обязательно идёт другой
        2)При помощи поиска в глубину ищем циклы, каждый новый найденный цикл сохраняем, сохраняются все участвующие вершины,
        Помимо этого помечаются общие вершины у циклов.
        3)Проходимся по общим вершинам у циклам (желательно начинаем с точек с наибольшим количеством циклов). Если эта точка (v_i) соответствует хоть 1 существующему на данном этапе циклу, то удаляем её и 
        строим на её основе граф v_1 -> W(вершина, в которую вложены подграфы) -> v_1
        При этом мы ещё как-то должны определить отдельные подграфы в которых тоже есть вложенные циклы
        Если цикл суперпростой, то отмечаем его как простой и сохраняем его в отдельную специльную вершину

        Цикл назовем суперпростым, если для каждой вершины в нём верно, что она существует только в единственном цикле (и этот цикл простой)

        ПРОБЛЕМА, А ЧТО ДЕЛАТЬ С ЦИКЛОМ ИЗ 1 элемента (петли)?
        А ничего, просто заранее циклы с количеством вершин = 1

        Итак начало
        Есть матрица смежности matr, где matr[i][j] in {0, 1}, 1 - j-й символ должен стоять после i-го символа, 0 - необязательно
        Также храним булевый массив cycles, где cycles[r] - существование r-го цикла (если хоть одна его вершина удалена, он перестаёт существовать).
        Также храним 2мерный массив in_cycles - где in_cycles[i][k] = r - номер k-го цикла, в который входит вершина v_i, соответствующий cycles[r]

        Для поиска в глубину используем массив необследованных вершин unobserved, 
        где observed[i] - цвет связного подграфа, если observed[i] == 0 - не рассмотренный, иначе принадлежит какому-то подграфу с номером
        массив текущих рассматриваемых вершин marked, marked[i] in {0,1} - i-я вершина в стеке или нет
        Ещё и стек used, где used[s] = i - номер вершины выбранный на s-м шаге.

        Вместе с поиском в глубину определяем и подграфы (компоненты связности)
        если компонента связности не имеет циклов, то оставляем его как "слагаемое" (или "константу")
        все ацикличные компоненты связности "складываем" и не трогаем, количество символов не меняется в них
        
        Поиск в глубину с нахождением циклов и компонентов связности:
        int color = 1;
        int level = 0;
        for (unsiged int i = 0; i < n; ++i) {
          if (observed[i] == 0) {
            observed[i] = color;
            ++color;
            used.push_back(i);
            marked[i] = 1;
            level = 2;
            while (!used.empty()) {
              for (unsigned int j = 0; j < n; ++j) {
                if (matr[used.back()][j]) {
                  if (marked[j]) {
                    //TODO:цикл найден, подумай о том в каком виде нужно сохранять циклы (цикл это вершины от used[marked[j]-1] до used[used.size()-1])
                  } else if (observed[j] == 0) {
                    observed[j] = observed[used.back()];
                    marked[j] = level;
                    ++level;
                    used.push_back(j);
                    break;
                  } else if (observed[j] != observed[used.back()]) {
                    old_color = observed[used.back()];
                    new_color = observed[j];
                    for (unsigned int k = 0; k < n; ++k) {
                      if (observed[k] == old_color) {
                        observed[k] = new_color;
                      }
                    }
                  }
                }
              }
              marked[used.back()] = 0;
              used.pop_back();
              --level;
            }
          }
        }

        Допустим, мы знаем какие вершины лежат в компонентах свяязности, для них создаём отдельные матрицы смежности, в которых обнуляем ненужные строки
        будет у нас matr1, matr2...

        Далее циклы, в случае удаления вершины, циклы превращаются в ациклический подграф (они могут быть частью связного графа с циклами, в которых не было) удалённой вершины
        Итак, вершина является точкой сочленения в ориентированном графе, если при её удалении граф на подграфы
        
        Итак, проходимся по циклам, сперва сохраняем простые циклы размером 1 (петли), помечаем и сохраняем их как особые цикленные вершины,
        //TODO:
        Пусть есть множество циклов C = {C_1, C_2, ..., C_r}, где C_i = {v_{j_1}, v_{j_2},...,v_{j_k}} - множество вершин входящих в цикл
        Итак есть множество компонентов связности G = {G_1, G_2,.., G_l,...}. 
        Логично предположить что если какая-то вершина v_j принадлежит к какой-нибудь компоненте связности, то и все циклы, в которые она входят тоже в этой же
        компоненте связности.
        Пусть H_i - подмножество циклов, в которых присутствует вершина v_i, H_i = {C_k: v_i in C_k}
        Пока C не пусто:
          ищем v_i <- argmax|H_i|
          ищем G_l, для которого v_i in G_l
          Если |H_i| == 1:
            Если для каждого v_j \in C_k |H_j| == 1:
              p_s<-C_k (стягиваем цикл в новую вершину p_s)
              (То есть добавляем в G_l вершину p_s, копируем в неё все входы и выходы из вершин в C_k, сами вершины сохраняем в ней как суперпростой цикл)
              B <- C_k
              G_l <- (G_l-B) U p_s
              B отмечаем как детерминированный цикл и сохраняем его в G
          Иначе:
            Далее осуществляем 2 процедуры в качестве предыдущей вершины берём v_i
            Ищем вершины v_j у которых единственный выход и это предыдущий найденный v_j (v_prev) заканчиваем на вершине, у которой входов более 1
            Ищем вершины v_j у которых единственный вход и это предыдущий найденный v_j (v_prev) заканчиваем на вершине, у которой входов более 1
            Это множество вершин записываем в X (все эти вершины находятся во всех тех же циклах, что и v_i)
            B <- G_l-X
            Стягиваем множество G_L-X в b
            G_L<-X U b
            G_L помечаем как детерминированный цикл
            b - помечаем как вершину со вложенной структурой
            X - помечаем как цикленные вершины
            Далее в множестве B ищем отдельные связные компоненты (опять же поиском в глубину) и сохраняем их в G
            (Там ещё надо учесть, что некоторые вершины уже удалены
          C <- C - H_i
        Конец цикла

        После предыдущей процедуры мы получаем множество компонент и "детерминированных" циклов
        Пусть A - массив количества вершин, где A[v_i] изначально 0
        Для каждой G_k in G:
          Если G_k - не вложенная компонента и не цикл:
            Для каждой вершины v_i in G_k:
              A[v_i] = A[v_i]+1
            G = G - G_k (удаляем эту компоненту)
        Удалили обычные компоненты. остались только циклы и вложенные компоненты

        //TODO: Строим из G дерево GTree - где каждый узел - компоненты, его дети - вложенные компоненты, корнем
        //TODO: Проблема в петлях (если петля есть во вложенном цикле тогда в качестве меняющейся вершины может быть только она)
        //TODO: Также для каждой вершины в детерминированных циклах должен быть определен вес, в детерминированных циклах выбираются вершины
        с наименьшим весом
        Далее идёт бектрекинг....
        


        Итак, попробуем ещё раз
        1)Создаём на основе words граф G
        2)На основе поиска в глубину получаем:
          -множества циклов C = {C_1, C_2, ..,}, C_i - множество вершин входящих в циклов
          -подмножества D_i in C - циклов в которые входит вершина v_i
          -множество связных компонент G_1, G_2, G_3.... (разумеется они не имеют общих вершин и рёбер)
        
        3)Далее берём вершину v_i с максимальной |D_i|, а также все те вершины v_j, такие, что D_j = D_i и строим из них множество X
        //TODO: Но что делать в случае если какой-то C_r = X и какая-то из вершин или несколько являются петлями?
        //NOTE: Ну одновременно C_r = X и присутствие петель невозможно, потому что иначе D_j != D_i
        //TODO: При удалении петли наверное стоит
        Далее находим множество компнент B = G_l - X.
        Сохрянаяем множество компанент B как множество детей узла G_l, само множество B в G_l стягиваем в вершину b
        G_l = X U b (если множество B не пустое)
        G_l = X (если множество B - пустое, то есть G_l - простой цикл)
        G = G + B (добавляем компоненты из B во всё множество компнентов)
        Множество X можно рассматривать как подмножество компонент из 1 элемента
        C = C - D_i
        Для каждой необработанной v_j обновляем D_j

        4)Сверху мы по сути строили дерево компонентов. Теперь нужно расчитать вес каждого компонента
        Каждая компонента обладает своим весом
        w(G_l) = |X| + w(B) + 1 (если G_l была преобразована)
        w(G_l) = |G_l| - если осталась не тронута (G_l не содержит циклов)
        каждая вершина v_i из X имеет вес = 1
        w(v_i) = 1
        Вес b составляет сумму всех подкомпонент B_i
        w(b) = w(B) = sum(w(B_i))
        Если B_i - петля(цикл из одного элемента), 
        w(B_i) = 0
        Для каждого компонента храним не только его вес, но и наименьший вес из весов вершин
        Также определяется, является ли компонент и его дети циклосодержащими
        
        Количество каждого встреченного символа = 1,

        //TODO: Что делать с петлями-то?
        5)Подготовка к backtracking
        Количество каждого встреченного символа = 1,
        Делаем обход всего дерева и создаём массив доменнов:
        Если компонента является циклом:
          Если min(w) == 0 (петля):
            Мы увеличиваем на 1 значение соответствующего символа (навсегда)
          Иначе:
            Создаём домен из номеров вершин, вес которых = 1
          Продолжаем обход, если компонента является подциклосодержащей
        
        6)Через backtrack осуществляем поиск всех возможных сочетаний)
        */

        /*
        1)Допустим на основе words построим матрицу смежности, это и будет граф G
        std::vector<std::vector<int>> graph;
        std::vector<int> mapping;
        createGraph(words, graph, mapping);
        2)Далее, осуществляем поиск в глубину и находим 
        std::vector<std::vector<int>> cycles - cycles[i] содержит массив вершин в него входящих
        std::vector<std::vector<int>> in_cycles - in_cycles[v] содержит индексы циклов из cycles, в которых содержится значение v
        std::vector<int> in_components - массив цветов - каждый цвет определяет принадлежность к отдельной компоненте связности
        find_cycles(graph, cycles, in_cycles, in_components);
        3)Далее, распределяем вершины по компонентам (и изменяем номера компонент):
        std::vector<std::vector<int>> components - components[i] содержит массив вершин, входящих в i-ю компонент связности
        fill_components(in_components, components);
        4)Далее, нам нужно построить дерево на основе данных о циклах и компонентах
        //TODO: Нужно наверное создать целый класс
        5)Далее нужно на основе этого дерева построить массив из доменов вершин.
        //TODO: Ну
        GTree gtree;
        std::vector<std::vector<int>> domains;
        std::vector<int> baseCounts;
        buildDomainArray(gtree, mapping, domains, baseCounts);
        6)Далее backtracking обход массива
        std::vector<std::vector<int>> result;
        backtrack(domains, baseCounts, result);
        */
    }
    void backtrack(const std::vector<std::vector<int>> &domains, std::vector<int> &counts, std::vector<std::vector<int>> &result) {
      std::vector<int> stk;
      stk.reserve(domains.size());
      for (std::size_t i = 0; i < domains.size(); ++i) {
        stk.push_back(0);
        counts[domains[i][0]]++;
      }
      result.push_back(counts);
    }
};