#include <vector>

class Solution {
public:
    bool isValidSudoku(std::vector<std::vector<char>>& board) {
        /*
        Итак, нужно проверить текущую доску на валидность
        Итак, создаём массив rows[9], cols[9], quads[3][3], который хранит маски текущих элементов (битовая маска домена)
        Ещё нужно избежать случаи, когда есть какой-то элемент, допустим 8, и он есть в левом столбце в верхнем квадрате, в правом столбце в нижнем квадрате, но при этом средний столбец в среднем квадрате заполнен полностью и в нем нет 8
        
        Итак, у каждой строки, столбца и квадрата есть своя маска доменов.
        Если нашли какой-то элемент, которого нет в домене текущего подмножества, то добавляем его в домен, продолжаем проверку по отношению к другим элементам
        Если нашил какой-то элемент, который уже есть в домене текущего подмножества, то останавливаемся, возвращаем false

        Как избежать этот частный случай?
        Когда есть какой-то элемент, допустим 8, и он есть в левом столбце в верхнем квадрате, в правом столбце в нижнем квадрате, но при этом средний столбец в среднем квадрате заполнен полностью и в нем нет 8

        Допустим, у нас есть битовая маска
        Алгоритм, примерный:
        
        Первая фаза - заполнение доменов, обходим все клетки.
        Обходим каждое значение (мы знаем текущие i,j - индексы столбцов и строки, q1,q2 - индексы текущего квадрата)
        Проверяем значение текущей клетки - если оно уже есть в домене
        Строки (rows[i]), столбца (cols[j]) или квадрата (quads[q1][q2]) - возвращаем false
        
        Вторая фаза - нужно как-то заполнять строки.
        Обходим каждый квадрат, определяем какие домены доступны в каждой подстроке и подстолбце в каждом квадрате, если количество = 3


        */
    }
};