#include <iostream>
#include <vector>

//TODO:

class Solution {
    public:
        int findMinStep(std::string board, std::string hand) {
            /*
            Вариация игры Зума, где дан ряд шаров разного цвета и шары в руке, вставляем новые шары вряд, и если 3 и более подряд шара совпадают по цвету, то
            удаляем эти шары, если после удаления опять образуются 3 и более подряд шара, их тоже удаляем и продолжаем процесс рекурсивно...
            Задача, найти минимальное количество шаров, которое можно вставить в ряд, чтобы выиграть или -1 если победить невозможно
            Так, шары имеют всего 5 цветов

            Эта задача очень похожа на задачи про правильные скобочные последовательности
            Итак, значит нам надо как-то установить "глубину" таким неполных скобочных последовательностей
            Плюс, есть проблемы с пересечениями
            М-да, вот это да, реально сложная задача
            Так, шары имеют всего 5 цветов
            Тогда начинаем 
            Тут как-то сложновато определить  количество вложенных последовательностей
            
            Логично предположить, что вставлять шар одного цвета между шарами другого цвета не имеет смысла

            Похоже что тут надо использовать стек, возможно не один, один будет загружать значения на вход внутрь последовательности, второй на выход
            Возможно также стоит хранить массив суффиксов и префиксов, в которых хранятся индексы и количество элементов справа или слева, если между
            этими 2-мя индексами можно сформировать индексы
            Итак допустим, используем массив суффиксов
            Берём первый элемент, и берём следующие 2 шара того же цвета, решаем 2 подзадачи сколько шаров потребуется чтобы превратить в пустую последовательность правый и левый подинтервал
            Брать эти интервалы необязательно из первых следующих после шаров того же цвета, можно какой-нибудь шар перескакивать
            
            Возможно тут как в тех задачах стоит использовать баланс для цвета каждого шара
            Если баланс 
            Ну допустим 
            WWBWBB - добавляем 2 W между BB + W слева - минимум 3 шара
            Как доказать что проще нельзя?
            Нужно вычислить какой-то критерий строки
            Пример
            WWBBWWB - Здесь 2 шара нужно цвета W, чтобы удалить последовательность

            Так, допустим, идём слева направо.

            Наивный метод - проходимся по всему массиву и вставляем где нужно либо 1, либо 2 шара такого же цвета, смотрим, удалилось ли всё
            Далее, следующая итерация
            Можно воспользоваться поиском в ширину
            Блин, такая бессмысленная задача, потом решу

            Итак, мы должны решить задачи нескольких типов:
            F(X) = F(X_1) B F(X_2) B F(X_3) B F(X_4) - полное разделение на 3-ки ( дополнительная плата - 0 шаров)
            F(X) = F(X_1) BB F(X_2) B F(X_3) - дополнительная плата - 0 шаров
            F(X) = F(X_1) B F(X_2) BB F(X_3) - дополнительная плата - 0 шаров 
            F(X) = F(X_1) B F(X_2) B F(X_3) - дополнительная плата - 1 шар
            F(X) = F(X_1) B F(X_2) - плата - 2 шара в любом случае,
            F(X) = 0 - пустота

            Итак, рассмотрим ячейки x_i между шарами b_i ()
            b_1 x_1 b_2 x_2 b_3 ... b_{n-1} x_{n-1} b_{n} x_{n}
            В каждую ячейку мы можем класть от 0 до 2 шаров одного цвета.
            Переменные:
            XY - пары (количество шаров, цвет шаров), вставляемых после b_i
            XY = ((x_1, y_1), ..., (x_n, y_n))
            Домены:
            D_{XY_i} = {0, 1, 2} X {W, B, R, Y, G}
            Ограничения:
            C1)y_i = b_i
            C2)sum(X)<=hand - количество шаров в руке
            C3)//TODO: Надо как-то сформулировать условие вложенности (что вложенное количество = 3, либо все подмножество точек является вложенное)

            
            Как для каждой точки выразить этот уровень вложенности?
            Ну допустим наивый
            */
            
        }
    };