#include <vector>
#include <string>

//TODO: Давай, придумай алгоритм решения сам

/*
Двоичный поиск
есть 2 массива
A и B
Нужно найти их общую медиану
Итак, рассмотрим 2 задачи отдельно
1 Задача - |A|+|B| - нечетное
Нужно найти такой элемент c массива C=sort(A+B), что количество элементов <= c (назовем это m) == количеству элементов >= c (назовем M)
Итак, у нас в начале
Нам известны A_1, A_N, B_1, B_M
сравниваем их друг с другом
Возникают следующие ситуации:
1)A_N <= B_1 - значит у нас "неперемешанные массивы"
2)A_1 <= B_1 <= A_N <= B_M - частично перемешанные массивы
3)A_1 <= B_1 <= B_M <= A_N - массивы 1 внутри другого
Остальные ситуации такие же, если поменять A и B местами

1)ситуация самая тривиальная - Если N > M, то mediana = A_{(N+M)/2+1}, иначе mediana = B_{(N+M)/2-N+1}
2)Пусть L(element) - количество значений t из массивов A, B, такое, что t <= element,
R(element) - количество значений t из массивов A,B, такое, что t >= element
приписки _down и _up означают нижние и верхние границы соответственно, если обычные значения L и R неизвестны
в начале 
L(A_1) = 1,R(A_1) = M+N;
L_down(B_1) = 2, L_up(B_1) = N, R_down(B_1) = M+1, R_up(B_1) = N+M-1
L_down(A_N) = 3, L_up(A_N) = N+M-1, R_down(A_N) = 2, R_up(A_N) = M
L(B_M) = M+N, R(B_M) = 1

i = N / 2,
j = M / 2,
Ищем значения A_i, B_j
Если A_i >= B_j => A_N > B_j
A_1 <= B_1 <= B_j <= A_i <= A_N <= B_M
Обновляем значения
L_down(A_N) = N + M/2 > (N+M)/2 - отбрасываем все проверки членов справа от A_N
R_down(B_1) = M + N/2 > (N+M)/2 - отбрасываем все проверки членов слева от B_1
L_down(B_j) = (j+1), L_up(j+i-1), R_down(B_j) = (N-i+1+M-j+1), R_up(B_j) = (M+N-2)
R_down
Итак алгоритм следующий

Сделаем проще
Если B_j < A_i, то решение где-то между B_j, B_M и между A_1, A_i
Иначе меняем A, B массивы местами, чтобы вернуться к предыдущему утверждению
B_j <= B_j2 <= B_M
A_1 <= A_i2 <= A_i
j2 = (M+j+1)/2 = (M+(M+1+1)/2+1)/2 = (M+1)/2 + (M+2)/4
i2 = (i+1+1)/2 = ((N+1+1)/2+1+1)/2 = (2)/2 + (N+2)/4
Если Если 

            A_left  A_center  A_right
B_left
B_center
B_right
Если A_center > B_center, то A_right = A_center
B_left = B_cente
B\A 1 3 4 7 8 10 11
2   
5
6
8
1 2 3 4 5 6 7 8 8 10 11
медиана = 6
A_left = 1, A_right = 11 (left = 1, right = 7)
B_left = 2, B_right = 8  (left = 1, right = 4)
A_center = 7, center = 4
B_center = 5, center = 2
B_center < A_center
L_down(A_center) = (6) > 11 / 2
R_down(B_center) = (4+3) > 11/2

Короче, алгоритм следующий берём
Берём границы A_left и A_right, B_left и B_right, переменные L_A_right, L_A_left, R_A_right, R_A_left, L_B_right, L_A_left, R_B_right, R_A_left
Вычисляем A_center и B_center
Если A_center < B_center

Лемма 1:
Медиана двух массивов A и B
m = sum(T)/|T|, множество T - множество элементов t in T, что |L(t)-R(t)| < 1

Лемма 2:
Пусть left1 и right1 границы подмассива A, для которых гарантировано, что A[left] <= mediana <= A[right]
(Это гарантировано если R_down(A[left]) >= (|A|+|B|)/2 + (|A|+|B|)%2 <= L_down(A[right]))
Аналогично для left2, right2 и B.
Тогда пусть center1 = (left1 + right1)/2, center2 = (left2 + right2)/2
A[center1] <= B[center2], то тогда решение может содержаться в подмассивах A[center1,right1] и B[left2, center2]
Потому что L(B[center2]) >= center2 + center1, 
R(A[center1]) >= |A|-center1 + |B|-center2 гарантированно
L(A[center1]) >= center1
R(B[center2]) >= |B|

Короче, в ситуации, если для каждой границы массива известно, что количество элементов слева и справа >= половины элементов,
то обновляем границы, 
Например, если L(B[center2]) больше половины, то right2 = center2, аналогично с left и right

Нужно также предварительно выяснить в каком порядке идут A[left1], A[right1], B[left2], B[right2]
Если A[right1] <= B[left2], то:

    Если right1-left1+1 >= right2-left2+1, то:
        в случае

Если оба массивы четные:
A:1 3 5 7 9 11 13 15
B:0 4 8 10 12 14
A:left = 0,right = 7, A[left] = 1, A[right] = 15
B:left = 0,right = 5, B[left] = 0, B[right] = 14
B[left2] < A[left1] < B[right2] < A[right1]
L(B[left2]) = 1
Пусть есть 2 упорядоченных по возрастанию массива

Есть A[left1], A[right1], B[left2], B[right2] - вычисляем 

И

Вопрос, возможна ли такая ситуация, что в процессе деления отрезков пополам существуют такая B[left2-1] >= A[right1] или A[right1+1] < B[left2]?
Короче говоря, возможна ли такая ситуация, что при использовании алгоритма деления пополам, что мы получаем отрезки, между которыми содержаться элементы, не содержащие эти отрезки
Итак, 3 ситуации
1)Если отрезки граничат друг с другом, то есть A[left1] <= A[right1] <= B[left2] <= B[right2]
Тогда мы уже точно знаем left_down(A[left1]) и right_down(B[right2]). Нужно правда доказать как-то что элементов между A[left1] и A[right1] сущестуют только элементы из A, аналогично для B[left2] и B[right2] сущестуют только элементы из B, и между A и B не существует никаких элементов
2)Если отрезки пересекают, то есть A[left1] <= B[left2] <= A[right1] <= B[right2]
3)Если один отрезок в другом, то есть A[left1] <= B[left2] <= B[right2] <= 

Надо качественно формализовать задачу
Пусть есть 2 отсортированных массивов A и B, и отсортированный массив C, полученный из элементов массивов A и B.
Пусть функция num = num(arr) - номер массива arr, num(A) = 0, num(B) = 1.
Для каждого элемента arr[i] сопоставим упорядоченную тройку (arr[i], i, num(arr)). Множество таких троек назовем множеством M_C.
Определим отображения L,R: M_C->N.
Пусть функция L = L(t,pos,num) означает номер элемента "слева" в массива C элемента t, находившегося в массиве под номером num на позиции pos.
Пусть над множеством значений функции L определено следующее отношение порядка:
1)Если t1 < t2, то L(t1, pos1, num1) < L(t2, pos2, num2)
2)Если t1 == t2 == t:
    2.1)Если num1 < num2, то L(t, pos1, num1) < L(t, pos2, num2)
    2.2)Если num1 == num2 == num и pos1 < pos2, то L(t, pos1, num) < L(t, pos2, num)
Наименьшее значение min(L) = 1, наибольшее значение max(L) = |C|, 
L(t2, pos2, num2) = L(t1, pos1, num1) + 1, если не существует такой тройки (t,pos,num), что L(t1,pos1,num1) < L(t,pos,num) < L(t2,pos2,num2)
Аналогично определим функцию R(t,pos,num), означающий номер элемента "справа" в массиве C элемента t, находившегося в массиве под номером num на позиции pos.
Над множеством её значений тоже определим следующим образом отношение порядка:
1)Если t1 < t2, то R(t2, pos2, num2) < R(t1, pos1, num1)
2)Если t1 == t2 == t:
    2.1)Если num1 < num2, то R(t, pos2, num2) < R(t, pos1, num1)
    2.2)Если num1 == num2 == num и pos1 < pos2, то R(t, pos2, num) < R(t, pos1, num)
Аналогично для R как для L, min(R) = 1, max(R) = |C|,
R(t2, pos2, num2) = R(t1, pos1, num1) + 1, если не существует такой тройки (t,pos,num), что R(t1,pos1,num1) < R(t,pos,num) < R(t2,pos2,num2)

Лемма 1:
Пусть для произвольных arr1[i] и arr2[j] верно: L(arr1[i], i, num(arr1)) < L(arr2[j], j, num(arr2)).
Тогда R(arr1[i], i, num(arr1)) > R(arr2[j], j, num(arr2))
Доказательство:
L(arr1[i], i, num(arr1)) < L(arr2[j], j, num(arr2)) верно, если:
1)arr1[i] < arr2[j], тогда по определению функции R верно R(arr2[j], j, num(arr2)) < R(arr1[i], i, num(arr1))
2)Далее аналогично, мне лень доказывать
Следствие леммы 1: При возрастании значения функции L на 1, значение функции R падает на 1 и наоборот. Доказывать впадлу, это очевидно

Определение 1:
Пусть M \in M_C - подмножество таких значений (t, pos, num), для которых верно неравенство |L(t, pos, num) - R(t,pos,num)| < 1, тогда
медиана m = sum(t_i)/|M|, где t_i - значение элемента из тройки (t_i, pos_i, num_i) \in M

Лемма 2:
|M| <= 2
Доказательство: очевидно
1)Если существует r \in M_C, такое что |L(r)-R(r)| = 0;
для r1, для которых L(r1) > L(r), и (из леммы 1) R(r1) < R(r), получаем R(r1) <= R(r) - 1, L(r1) >= L(r) + 1
тогда R(r1) - L(r1) <= R(r) - 1 - L(r1) <= R(r) - 1 - L(r) - 1 <= -2
Для L(r1) - R(r1) >= L(r)+1 - R(r1) >= L(r)+1 - R(r)+1 >= 2
Таким образом |L(r1)-R(r1)| >= 2, то есть |M| = 1, M состоит только из элемента r.
2)Далее для r1, r2 \in M_C, для которых известно что L(r1)-R(r1)=-1, L(r2)-R(r2)=1, доказываем то же самое...
Более того R(r2) = R(r1)-1, L(r2) = L(r1)+1...
3)Предположим, что помимо r1 и r2, существует такое r, для которой верно |L(r)-R(r)| < 1.
Тогда либо L(r)-R(r) == 0, но тогда L(r1) < L(r) < L(r2), R(r1) > R(r) > R(r2), что по следствию леммы 1 невозможно
либо L(r)-R(r) = 1, но тогда r = r2, что противоречит условию
либо R(r)-L(r) = 1, но тогда r = r1...

Следствия леммы 2:
1)Если |M_C|%2 == 0, то m = (C[|C|/2] + C[|C|/2+1]) / 2
Иначе m = C[|C|/2+1]

Лемма 3:
Пусть существует такая пара индексов i1, i2, i1 < i2, для которых верно, что L(A[i2], i2, num(A)) = L(A[i1]) + i2 - i1.
тогда не существует такого индекса j, для которого верно L(A[i1], i1, num(A)) < L(B[j], j, num(B)) < L(A[i2], i2, num(A))
Доказательство: доказывать впадлу, а так вроде по индукции на основе случая L(A[pos + 1]) = L(A[pos]) + 1

Теорема 1:
Если для r1 \in M_C L(r1) >= |C|/2 + |C|%2 (или R(r1) >= |C|/2+|C|/2), тогда множество M \in M_C\{r: L(r) > L(r1)} (M \in M_C\{r: R(r) > R(r1)})
Доказательство:?
Для функции L будем говорить теорема 1L, для R теорема 1R

Теорема 2:
Пусть для пары r1, r2 \in M_C известно, что L(r2) >= |C|/2 + |C|%2 <= R(r1), тогда множество M (медианное множество) содержится целиком в множестве
M_C\{r: L(r) > L(r2) || R(r) > R(r1)}
Доказательство:?

Для элемента множества M_C r = (t, pos, num) определим функцию pos(r) = pos.

Теорема 3:
Пусть для пары r1, r2 \in M_C верна теорема 2 и num(r1) == num(r2) и pos(r2)-pos(r1) > 1, тогда существует такая точка r \in M_C: num(r) == num(r1), L(r1) < L(r) < L(r2),
для которой будет верно использовать теорему либо в паре (r1, r), либо в паре (r, r2)
Доказательство:?

Теорема 4(усиленная теорема 3):
Пусть для пары r1, r2 \in M_C верна теорема 2 и num(r1) == num(r2) и L(r2) - L(r1) = pos(r2) - pos(r1) > 0, тогда:
Если |M_C| четно, то i = |M_C|/2 - L(r1) + pos(r1), m = (arr[i] + arr[i+1])/2
Если |M_C| нечетно, то i = |M_C|/2 + |M_C|%2 - L(r1) + pos(r1), m = arr[i]
Доказывать впадлу.

Теорема 5("о 4 оставшихся"):
Пусть осталось 4 элемента в |M_C|, тогда ищем медиану через них пользуясь

Итак рассмотрим алгоритм
1)Пока i_last - i_0 > 1 и j_last - j_0 > 1
Вычисляем i1, i2 и j1, j2.
Если A[i1] <= B[j2], то i_0 = i1, j_last = j2 (по теореме 2 отбрасываем остальные варианты)
Иначе, если B[j1] < A[i2], то i_last = i2, j_0 = j1 (по теореме 2)
2)Итак, мы можем для крайних элементов зафиксировать значения L и R гарантировано (Края могут быть из одного массива, а могут из разных)
Далее, по идее нам достаточно 
A1 B1 B2 A2 A3 B3 A4 A5 A6 A7 A8 A9 A10 A11 A12 A13 A14 A15 A16
A1 -- B2 A2 A3 B3 A4 A5 A6 A7 A8 A9
A1 B1 B2 A2 A3 B3 A4 A5 A6 A7 A8 A9 A10 A11 A12 A13 A14 A15 A16 A17 A18 A19 A20 A21 A22 A23 A24 A25 A26 A27 A28 A29 A30 A31 A32
Итак, походу 1 тип работает не совсем верно

Алгоритм (скорректированный):
Пока i_last - i_0 > 1 и j_last - j_0 > 1:
1)Вычисляем левую и правую точные границы (левой является либо A[i_0], либо B[j_0], правой является либо A[i_last], либо B[j_last])
1)Либо вычисляем максимальный индекс элемента другого массива, который больше элемент из текущего, если такого индекса нет храним -1
И минимальный индекс которого меньше (если такого индекса нет, храним размер массива)
Пример:
element:A[0]    B[0]    A[i_l]  B[j_l]
num:    num0    num0    num1    num1
L:      -1      0       0       i_l
R:      0       i_l     j_l     -1

Вычисляем A[i1], A[i2], B[j1], B[j2]
Или просто A[i], B[j]
Сравниваем A[i] с B[j_0], B[j], B[j_l], (находим значения L(A[i]), R(A[i]), а ткаже обновляем значения L,R для B)
Сравниваем B[j] c A[i_0], A[i], A[i_l], аналогично как для A[i]
Далее, выбираем при помощи значений L, R какие интервалы выбрать по теореме 2 (значения L+остаток1, R+остаток2, должны быть >= половины размера итогового массива)
Остаток1(A[t]) = t+1
Остаток2(A[t]) = size(A) - t

Если в конце получается, что интервалы не пересекаются, тогда мы долж

*/

class Solution {
    private:
        inline int L(int index, int left_index) {
            return (index + 1) + (left_index+1);
        }
        inline int R(int index, int right_index) {
            return L(index, right_index);
        }
        void binary_search_one_array(std::vector<int> nums, int &left, int &right, int &left_L, int &left_R, int &right_L, int &right_R, int olvalue, int orvalue){
            if (olvalue >= nums[right] || orvalue <= nums[left]) {

            }
        }
    public:
        double findMedianSortedArrays(std::vector<int>& nums1, std::vector<int>& nums2) {
            if (nums1[0] > nums2[0]) {
                std::swap(nums1, nums2);
            }
            int left1 = 0, right1 = nums1.size()-1, left2 = 0, right2 = nums2.size()-1, center1, center2;
            int left1_L, left1_R, right1_L, right1_R, left2_L, left2_R, right2_L, right2_R;
            //TODO: Надо инициализировать
            left1_L = 1;
            left1_R = right1+right2+2;
            if (nums1[right1] <= nums2[left2]) {
                /*left1 right1 left2 right2*/
                right1_L = right1+1;
                right1_R = right2+2;
                left2_L = right1+2;
                left2_R = right2+1;
                right2_L = right1+right2+2;
                right2_R = 1;
            } else {
                left2_L = 2;
                left2_R = 2+right2;
                if (nums1[right1] <= nums2[right2]) {
                    /*left1 left2 right1 right2*/
                    right1_L = right1+2;
                    right1_R = 2;
                    right2_L = right1 + right2 + 2;
                    right2_R = 1;
                } else {
                    /*left1 left2 right2 right1*/
                    right1_L = right1 + right2 + 2;
                    right1_R = 1;
                    right2_L = right2+2;
                    right2_R = 2;
                }
            }
            while (right1-left1 > 1 && right2-left2 > 1) {
                center1 = (right1 + left1)/2;
                center2 = (right2 + left2)/2;
                if (nums1[center1] <= nums2[center2]) {
                    left1_R = R(center1, nums2.size()-center2-1);
                    left1_L = left1_L + center1 - left1;
                    left1 = center1;
                    right2_L = L(center2, center1);
                    right2_R = right2_R +right2 - center2;
                    right2 = center2;
                } else {
                    left2_R = R(center2, nums1.size()-center1-1);
                    left2_L = left2_L + center2 - left2;
                    left2 = center2;
                    right1_L = L(center1, center2);
                    right1_R = right1_R + right1 - center1;
                    right1 = center1;
                }
            }
            if (right1-left1 > 1) {
                while (abs(right1_L - right1_R) > 1 && )
            }
            
            /*
            */
        }
    };