#include <vector>

class Solution {
    public:
        long long countInterestingSubarrays(std::vector<int>& nums, int modulo, int k) {
            /*
            Итак, нужно найти количество подмассивов nums[l,r], которое подчиняется следующему свойству
            Пусть cnt - количество индексов в отрезке [l, r], благодаря котором истино выражение nums[i] % modulo == k
            Тогда подмассив nums[l,r] интересный, если cnt % modulo == k
            При это подмассив не может быть пустым
            Итак, может ли нам помочь дерево отрезков?
            Наверное в ней нет смысла, но давай подумаем
            Можно сделать 2 указателя
            Ставим первый указатель на 0
            строим массив префиксов, в качестве префиксов записываем количество 
            Ошибся, 2-мя указателями нельзя сделать, это могло сработать если cnt == k, но cnt может быть равно k + x * modulo
            Тогда придётся строить дерево отрезков или корневую декомпозицию
            И что? А ничего
            Самый простой вариант - строим массив префиксов, который подсчитывает количество удовлетворяющих элементов слева и при помощи 2-х указателей постоянно проверяем разницу префиксов
            Проходимся так по массиву all_count / modulo раз, где all_count - это общее количество удовлетворяющих элементов слева
            Допустим 1 1 1 0 1 0 0 0 1 1 1 1 1 0 1, и тд... где nums[i] % modulo == k
            Итак, это массив префиксов, допустим мы находим интервалы подходящее для максимально допустимого k + x * modulo <= sum(prefix)
            Как вариант можно учитывать эти нули в задаче, тогда
            возможно 3x1 1x0 1x1 3x0 5x1 1x0 1x1
            */
        }
    };

int main(void) {
    return 0;
}