#include <cstring>
#include <iostream>

//SUCCESS

class Solution {
    public:
        int numTilings(int n) {
            /*
            Нужно найти количество способов, которым можно заполнить 2 x n клеток,
            Итак, мы знаем, что 
            2x1 можно заполнить 1 двойной 1 раз
            2x2 можно заполнить 2 2 раза
            2x3 можно заполнить 2 мя и тремя
            2x4...
            В голову пришла мысль
            Итак, у нас при правильном расставлении домино слева направо справа либо остаётся
            ровный прямоугольник, либо один квадратик выпирает либо 2 квадрата выпирает
            в первом и втором случаем мы можем брать либо 2-ю либо 3-ю штуку, в последнем случае
            только 2-ю
            Таким образом количество перестановок можно посчитать следующим образом:
            f(n, up, down) {
                Если n == 0:
                    Если up != 0 || down != 0:
                        Вернуть 0
                    Иначе:
                        Вернуть 1
                Если n == 1:
                    Если up != 0 && down == 0 || up == 0 && down != 0 || up == 0 && down == 0:
                        Вернуть 1
                Иначе:
                    Если up == 1:
                        Вернуть f(n-1, 0, 1) + f(n-1,0,0)
                    Иначе Если down == 1:
                        Вернуть f(n-1, 1, 0) + f(n-1,0,0)
                    Иначе:
                        Вернуть f(n-2, 1, 0) + f(n-1, 0, 0) + f(n-2, 0, 1) + f(n-2, 0, 0)
            }
            Задача на динамиеское программирование
            Исходя из свойств симметрии можно сказать, что количество решений f(n-2, 0, 1) = f(n-2, 1, 0) - мы вставляем тройные
            f(n-2, 0, 0) - случай, когда 4 клетки заполняем 2-мя горизонтальными 2ми
            Данную задачу можно решить жадно
            Идём по нисходящей
            Представим матрицу dp[n][2], где каждый j-й столбец описыает 3 значения
            1)0 - j-й столбец матрицы 2xn неполный
            2)1 - j-й столбец матрицы 2xn полный
            Итак, жадный алгоритм следующий:
            Сначала вбиваем первые два столбца:
            dp[0][PART] = 0
            dp[0][FULL] = 1
            dp[1][PART] = 1
            dp[1][FULL] = 2
            Итак, нам надо найти значение dp[n-1][FULL]
            Таким образом алгоритм следующий
            dp[n][2];
            dp[0][PART] = 0;
            dp[0][FULL] = 1;
            dp[1][PART] = 1;
            dp[1][FULL] = 2;
            for (unsigned int i = 2; i < n; i++) {
                dp[i][PART] = dp[i-1][PART] + dp[i-2][FULL];
                dp[i][FULL] = 2 * dp[i-1][PART] + dp[i-1][FULL] + dp[i-2][FULL];
            }
            return dp[n-1][FULL];

            Теперь попробуем без использования массива
            int dp[3][2];
            for (unsigned int i = 2; i < n; i++) {
                dp[2][PART] = dp[1][PART] + dp[0][FULL];
                dp[2][FULL] = 2 * dp[1][PART] + dp[1][FULL] + dp[2][FULL];
                memcpy(dp[0], dp[1], sizeof(int[2]));
                memcpy(dp[1], dp[2], sizeof(int[2]));
            }
            */
            int dp[3][2] = {0};
            dp[0][0] = 0;
            dp[0][1] = 1;
            dp[1][0] = 1;
            dp[1][1] = 2;
            for (unsigned int i = 2; i < n; i++) {
                dp[2][0] = dp[1][0] + dp[0][1];
                dp[2][1] = 2 * dp[1][0] + dp[1][1] + dp[0][1];
                std::memcpy(dp[0], dp[1], sizeof(int[2]));
                std::memcpy(dp[1], dp[2], sizeof(int[2]));
            }
            if (n > 2) {
                return dp[2][1];
            }
            return dp[n - 1][1];
        }
    };

int main(void) {
    int n = 0;
    std::cin >> n;
    std::cout << Solution().numTilings(n) << std::endl;
    return 0;
}