#include <vector>
#include <string>
#include <iostream>

class Solution {
    public:
        int largestPathValue(std::string colors, std::vector<std::vector<int>>& edges) {
            /*
            Итак, количество вершин в графе = colors.size(), edges = ребра (список смежных вершин, хотя тут не список)
            Итак, нужно найти маскимальное количество вершин одного цвета, которые есть в каком-нибудь (необязательно самом длинном) пути
            Ну, тут явно напрашивается поиск всех путей из всех вершин, только ищем не кратчайший путь
            Видимо придется идти и читать теорию графов, опять(
            Итак, в условии написано, что в случае, если граф содержит цикл, то вернуть -1
            Тогда
            1)При помощи поиска в глубину удостоверимся, что циклов нет (для этого будем помечать вершины как непросмотренные, просмотренные и используемые,
            если при обработрке текущей вершины одна из следующих вершин является используемой -> существует цикл)
            2)Далее, при помощи какого-нибудь алгоритма (либо Дейкстры из всех, либо Флойда-Уоршелла, возможно стоит для каждого цвета вычислять всё по отдельности
            То есть для вычисления каждого цвета требуется своя таблица)
            Тогда, можно сделать следующее
            Создаем таблицу d[u][v][26] - матрицу длиннейших расстояний между каждой вершиной u и v
            Далее у нас между каждой парой значение = количество того или иного цвета (если u = v, то цвет = 1 какой-то из 26)
            */
        }
    };

int main(void) {
    return 0;
}