#include <vector>

class Solution {
    public:
        int maxTaskAssign(std::vector<int>& tasks, std::vector<int>& workers, int pills, int strength) {
            /*
            Итак, есть несколько пилюль, которые повышают силу работников на величину strength
            Нужно определить подходящих работников, которым можно дать пилюли
            И посчитать максимальное количество пилюль

            Итак, предположения
            Сортируем работников по возрастанию силы
            Сортируем задачи по возрастанию требования силы
            Начиная с первого (самого) работника смотрим какие задачи ему по силам,
            Если такая задача найдется то ему пилюля не нужна (он уже работает, а раз он смог, значит и другие смогут)
            Если такой задачи нет, то выбирается минимальная по силе работа (возникает проблема, а что если эту работу сможет выполнить кто-то постарше)
            Далее для более старших выбираем работу аналогично
            Проблема, задач может быть меньше чем рабочих, Тогда наверное стоит начинать с большего рабочего?

            Это задача точно на жадный выбор или дп, только не очень понятно, что выбирать в качестве оптимальной подструктуры
            Хорошо, Допустим у рабочего есть выбор, либо занять максимальную работу, которая ему по силам, либо принять пилюлю и выполнить задачу, до которой
            чуть чуть не хватает, но есть проблема - на одну и ту же работу может претендовать несколько работников
            Пусть w = (w1,w2,...,wm) - последовательность работников, где wj - сила j-го работника,
            t = (t1,t2,...,tn) - последовательность задач, где ti - требуемая сила для решения i-й задачи.
            Ладно, для каждого работника смотрим на 2 атрибута:
            1)Нижняя граница посильных для него задач (Например, он подходит в 5 из 7 задач, а может он вообще не подходит)
            2)Верхняя граница непосильных задач, но посильных с дополнительной силой s (Их тоже может и не быть)
            Тогда 
            */
        }
    };