#include <vector>
#include <iostream>

//TODO: Вернись сюда, когда научишься по полной использовать деревья отрезков и тд

class Solution {
    public:
        int maxRemoval(std::vector<int> &nums, std::vector<std::vector<int>> &queries) {
            /*
            Дан массив nums, в котором хранятся числа >= 0
            Дан массив запросов queries, queries[i] = [l_i, r_i]
            Мы можем при помощи этих запросов уменьшать независимо каждый элемент в подмассиве nums[l_i, r_i] либо на 1, либо на 0
            Сколько максимально количество запросов мы можем удалить, чтобы получить нулевой массив
            Иначе, можно посмотреть, какие запросы нужны для того, чтобы создать этот массив из нулевого
            Например, сколько нужно использовать отрезков, чтобы превратить нулевой массив в исходный
            Опять че-то на дерево отрезков
            Допустим мы в начале отсортируем queries по максимальному размеру интервалов
            (типа в начале будем обрабатывать самые большие по покрытию элементов)
            Однако может быть такая хрень
            Допустим есть массив (1, 1, 1, 1, 1) и 3 запроса [0, 2], [1, 3], [2, 4]
            В этом случае мы минимально можем использовать [0, 2] и [2, 4], а [1, 3] - выкидываем
            И в каком порядке эти запросы рассматривать?
            Итак, судя по подсказкам я был прав насчет запросов
            */
        }
    };

int main(void) {
    return 0;
}