#include <iostream>


int main(void) {
    /*
    Не могу придумать решение
    Итак, у нас есть последовательность 2,3,4,7,15,100
    Попробуем вычислить префиксные суммы
    2,3,4,7,15,100
    2,5,9,16,31,131

    Итак, в прошлый раз я доказывал, 
    a 1 1
    a,b 2 2
    a,b,a+b 3 2
    a,b,a+b,c 4 3
    a,b,a+b,c,a+c 5 3
    a,b,a+b,c,a+c,b+c 6 3
    a,b,a+b,c,a+c,b+c,a+b+c 7 3

    Попробуем вот что
    Пусть мы имеем дело с системой линейных уравнений
    a11 * x1 + ... + a1n * xn = b1
    .....
    an1 * x1 + ... + ann * xn = bn
    соответственно aij имеет значение 0 и 1
    Итак, чтобы найти наименьшее количество ингридиентов необходимо найти наименьший возможный ранг такой системы матрицы A,
    Итак, наименьший вероятный ранг r = [log_{2}n] + 1
    Далее, какие элементы выбрать в качестве начальных элементов?
    в качестве x_ij выбираем какие-то из b_ij
    Пример такой загадочной матрицы:
    1 * x1 + 0 * x2 + 1 * x3 = b_{k1}
    1 * x1 + 1 * x2 + 0 * x3 = b_{k2}
    1 * x1 + 1 * x2 + 1 * x3 = b_{k3}
    Проблемы - мы не знаем ни как выглядит матрица A, ни какие элементы брать в качестве начальных x
    
    Итак, у такой системы точно известно, что элементов точно как минимум r
    И что...
    Другой вариант - 
    У нас лежит N рюкзаков вместимости b_i шаров
    нужно найти минимально возможное количество пакетов вместимости x_j шаров, чтобы любой из N рюкзаков можно было
    бы загрузить
    1 3 3 6 42
    1, 3, 6, 42 = 4 
    [log_{2}5] + 1 = 3
    дубликат сыграл свою роль, вроде бы нет...
    Итак, начиная с r элементов

    
    */
    unsigned int N = 0;

    std::cin >> N;


    return 0;
}