/*
    1)Делаем xor - всех элементов
    xor {42 1 3 3 6}, {}
    делаем слева по одному из элементов слева
    2)убираем по одному элементу
    {1, 3, 3, 6}, {}
    {42, 3, 3, 6}, {}
    2x{42, 1, 3, 6}, {}
    {42, 1, 3, 3}, {}
    {1, 3, 3, 6}, {42}
    {42, 3, 3, 6}, {1}
    2x{42, 1, 3, 6}, {3}
    {42, 1, 3, 3}, {6}
    Считаются xor и также слева подразделяются и добавляются вправо
    
    Алгоритм следующий
    left_xor подсчитан для всех элементов, right_xor вначале 0
    f(P_L, left_xor, P_R, right_xor) {
        s = (left_xor == right_xor) ? 1 : 0
        Для каждого элемента A в множестве P_L:
            s += f(P_L / {A}, left_xor ^ A, P_R, right_xor) + f(P_L / {A}, left_xor ^ A, P_R U {A}, right_xor ^ A)
        вернуть s
    }
*/

/*
Второй вариант - нужно найти все возможные непересекающиеся подмножества, которые вместе дают 0 в xor, тогда элементами можно как угодно манипулировать
Создаем дерево множеств
Примеры:
42 1 3 3 6
0){6, 42} | {1, 3, 3}
1){1} | {3, 3, 6, 42}
({} | {6, 42}) | ({1} | {3,3})
2){1, 3, 3, 42} | {6}
(({} | {42}) | ({1} | {3, 3}))|(({} | {6}) | ({} | {}))
(({1} | {3, 3}))
3){1, 3, 3, 6} | {42}
({1} | {}) | ({3, 3} | {}) - остается только {3, 3}
4){1, 3, 3, 6} | {42}
{3, 3} | {}

Таким образом мы получаем (2, 12, 14), (11, 11)
но ведь есть ещё (2, 9, 11), (5, 9, 12) и возможно ещё что-то

1    2    5    9    11   11   12   14   
0001 0010 0101 1001 1011 1011 1100 1110 
0)(2, 12, 14) | (1, 5, 9, 11, 11)
1)(1, 5, 9, 12) | (2, 11, 11, 14)
2)(1, 2, 9, 11, 11) | (5, 12, 14)
3)(1, 2, 5) | (9, 11, 11, 12, 14)
          00      01            11                10                
(0,1) - {12}   | {1, 5, 9}    | {[11, 11}]   | {2, 14}    
------------
(1,2) = {1, 9} | {2, [11, 11]}| {14}         | {5, 12}    
(2,3) = {1, 2} | {5}          | {12, 14}     | {9,[11,11]}
------------
(3,0) = {2}    | {12,14}      | {9,[11,11]}  | {1, 5}

{5 9  12}
01 01 00
10 00 10
01 
множество 00 может быть любым, главное, чтоб все были либо четные либо нечётные
если 

        000     001     010     011     100     101     110     111
        00-00   01-00   10-01   11-01   00-10   01-10   10-11   11-11
(0,1,2) {}      {1,9}   {2}     {11x2}  {12}    {5}     {14}    {}
(1,2,3) {1}     {2}     {5}     {}

0000, 0001^0010^0011 - 3 (эта и 2 сдвига влево),0001^0010^0100
матрица
Итак если разряд 1 - только 0
Если разряда 2       00 либо 01^10^11
(0 1)
(1 0)
(1 1)
Если разряда 3
000 либо 001^010^011 либо 001 ^ ()
(0 0 1) (0 0 1) (0 0 1) (0 1 0) (0 1 0) (0 1 1) (0 1 1)
(0 1 0) (1 0 0) (1 1 0) (1 0 0) (1 0 1) (1 0 0) (1 0 1)
(0 1 1) (1 0 1) (1 1 1) (1 1 0) (1 1 1) (1 1 1) (1 1 0)
Если разряда 4
(0 0 0 1) (0 0 0 1) (0 0 0 1) (0 0 1 0) (0 0 1 0) (0 0 1 1) (0 0 1 1) (0 1 0 0)
(0 0 1 0) (0 1 0 0) (0 1 1 0) (0 1 0 0) (0 1 0 1) (0 1 0 0) (0 1 0 1) ()
(0 0 1 1) (0 1 0 1) (0 1 1 1) (0 1 1 0) (0 1 1 1) (0 1 1 1) (0 1 1 0)

0,1,2,4 0000        0001        0010        0011        0100        0101        0110        0111
             001-000     010-001     011-001     100-010     101-010     110-011     111-011
        1000        1001        1010        1011        1100        1101
        000-100     001-100     010-101     011-101     100-110     101-110
        {}          
(0,2) = {2}    | {1, 9, [11, 11]}| {5}          | {12, 14}   
(1,3) = {1, 5} | {2}             | {[11,11],14} | {9}        
  

Проходим в каждой строчке и собираем элементы 
1)Если есть дубликаты - оставляем 1 (нужно ещё учесть, что делать если их количество чётное или нечетное)
В начале:
00->(00, 10)
01->(00, 10)
10->(01, 11)
11->(01, 11)
Для каждой возможной

    
(9, 2, 11)(2,12,14)(11, 11)

Заново:
1    2    5    9    11   11   12   14   
0001 0010 0101 1001 1011 1011 1100 1110 
0)(2, 12, 14) | (1, 5, 9, 11, 11)
0:(2, 12, 14) | 1:(1, 5, 9, 11, 11) - 0:xor = 0!
1)(1, 5, 9, 12) | (2, 11, 11, 14)
00:{12}, 01:{1, 5, 9}, 10:{2, 14}, 11:{11, 11}
00 | 01 ^ 10 ^ 11 = {12} | ({1, 5, 9} ^ {2, 14} ^ {11,11})
2)(1, 2, 9, 11, 11) | (5, 12, 14)
000:{}, 001:{1, 9}, 010:{2}, 011:{11,11}, 100:{12}, 101:{5}, 110:{14}, 111:{}
000 | 100 ^ ((110 ^ 010) | (101 ^ 001) | (111 ^ 011))
000 |
000 | (001 ^ 010 ^ 011) | 100 ^ ((101 ^ 001) | (110 ^ 010) | (111 ^ 011))
3)(1, 2, 5) | (9, 11, 11, 12, 14)
0000:{}, 0001:{1}, 0010:{2}, 0011:{}, 0100:{}, 0101{5}, 0110{}, 0111{},
1000:{}, 1001:{9}, 1010:{}, 1011:{11,11}, 1100:{12}, 1101:{}, 1110{14}, 1111{}

000 | (0001 ^ 0010 ^ 0011) | 0100 ^ ((0101 ^ 0001) | (0110 ^ 0010) | (0111 ^ 0011)) | ()


Заново:
1    2    5    9    11   11   12   14  42 43
0001 0010 0101 1001 1011 1011 1100 1110 
0)(2, 12, 14) | (1, 5, 9, 11, 11)
{2, 12, 14} | {1, 5, 9, 11, 11}
1)(1, 5, 9, 12) | (2, 11, 11, 14)

2)(1, 2, 9, 11, 11) | (5, 12, 14)
3)(1, 2, 5) | (9, 11, 11, 12, 14)


Задача поиска цикла
1   2   5   9   11  11  12  14
0   0   0   1   1   1   1   1
0   0   1   0   0   0   1   1
0   1   0   0   1   1   0   1
1   0   1   1   1   1   0   0

Алгоритм следующий - строим что-то наподобие множеств
Кладём множество A (копию) в список множеств ASet
Далее, для каждого бита:
    Строим 2 множества - P_1 и P_0 (множества чисел с установленным и сброшенным битом соответственно), находим их xor
    Для каждого множества ASet
    Ищем 

    В случае

Заново:
Итак новый вариант - необходимо найти все возможные варианты варианты xor разных чисел
Итак, начинаем с 0
0000 - нейтральный элемент
Умножаем на соседа
отмечаем как выход 0001, 0002
0001 xor 0002 - 0003 - помечаем, что 0003 можно заменить на 0001 xor 0002
Пока следующий элемент не помечен аходим его и помечает
0011 xor 0100 = 7
7 - результат xor 0100 0011
Далее 0100 xor 0101 - 1, помечаем 1 как результат xor (4, 5)
0101 xor 0110 = 0011 - помечаем 0110 как результат xor 3 и 6
Пусть у нас все числа < 16
1    2    3     4    5     6     7     8    9     10    11     12     13     14     15
0001 0010 0011  0100 0101  0110  0111  1000 1001  1010  1011   1100   1101   1110   1111
[]   []   [1,2] []   [1,4] [3,5] [3,4] []   [1,8] [3,9] [1,10] [7,11] [1,12] [3,13] [7,8]

1 2 5 9 11 11 12 14
Начиная с самого крупного числа смотрим
14 ->[3, 13], помечаем 14 как начало
[3, 13] -> [1, 2, 13], помечаем 1 и 2 как разложенные (то есть их трогать больше нельзя)
[1,2,13]->[1,2,12,1] - убираем 1-цы
[2,12] - эти числа есть - найден цикл 14->[2,12]
продолжаем расскладывать
[2,7,11]->оставляем 11, так как оно ещё не использовано
[2,3,4,11]->4-ки нет, дальнейшее разложение невозможно

12->[7,11]->[3,4,1,10]->[1,2,4,1,3,9]->[1,4,9]->[1,4,1,8]->[4, 8] - таких чисел нет
11->[1,10]->[1,3,9]->[2, 9] - разложение найдено
[2,9]->[1,2,8] - разложено для конца

Итак, брать степени 2-ки нельзя
берём число 5
5 ->[1,4] -> отмечаем 5-ку как раскладываемую в самый последний момент (нет подциклов)
Берём 9->[1,8] ->то же самое
Берём 11->[1,10]->остаётся раскладывать только 10->[1,[3,9]]->[1,[[1,2],[1,8]]]-получаем [2,9]
Итак, задача такая
просматриваем все элементы ещё раз и расставляем есть они или нет
Далее по расставленным элементам начиная с большего
просматриваем старшего ребёнка и младшего
если старший есть, то смотрим есть ли малый, если малого нет его раскладываем

Заново:
Практически тот же самый вариант, только мы помечаем элементы по мере их поступления
В порядке возврастания

1 2 5 9 11 11 12 14

1    2    3     4    5     6     7     8    9     10    11     12     13     14     15
0001 0010 0011  0100 0101  0110  0111  1000 1001  1010  1011   1100   1101   1110   1111
[]   []   [1,2] [нет] []   [3,5] [2,5] []   [1,8] [3,9] [1,10] [7,11] [1,12] [3,13] [7,8]
1,2->3
2,5->7
5,9->13
9,11->2 (если уже закрашено), то отмечаем как цикл
11,12->7 - если уже отмечено, (до этого было 2,5) , то помечаем как ещё один цикл
12,14->2 - уже закрашен, таким образом ещё циклы (12,14,9,11),(12,)

12,14-2-9,11
Более сложный пример
12 53 23 11 16 55 24 66 63 19 18 17 4 5

12,53->57

*/
/*
#include <map>
#include <functional>

class Tree {
public:
    Tree() : is_leave{false}, curr{}, children{} {};
    static Tree tree_end;
    Tree &operator[](unsigned int index) {
        auto iter = children.find(index);
        if (iter == children.cend())
            return tree_end;
        return (*iter).second;
    }
    bool operator!=(const Tree &other_tree) {
        return &other_tree != this;
    }
    void addElement(unsigned int number) {
        unsigned int state = number;
        auto tree_ref = std::reference_wrapper<Tree>(*this);
        for (unsigned int bit = 1 << 15; bit; bit >>= 1) {
            if (!state) {
                is_leave = true;
                curr = number;
                break;
            }
            if (state & bit) {
                auto &curr = tree_ref.get()[bit];
                tree_ref = curr.children[bit];
                state &= ~bit;
            }
        }
    }
    unsigned int getNextNum(unsigned int number) {
        
    }
private:
    std::map<unsigned int, Tree> children;
    unsigned int curr;
    bool is_leave;
};


>>> b1
({1: (1, 5, 9, 11, 11, 43)}, {2: (2, 11, 11, 14, 42, 43)}, {4: (5, 12, 14)}, {8: (9, 11, 11, 12, 14, 42, 43)}, {16: ()}, {32: (42, 43)})
>>> b0
({1: (2, 12, 14, 42)}, {2: (1, 5, 9, 12)}, {4: (1, 2, 9, 11, 11, 42, 43)}, {8: (1, 2, 5)}, {16: (1, 2, 5, 9, 11, 11, 12, 14, 42, 43)}, {32: (1, 2, 5, 9, 11, 11, 12, 14)})

Идея следующая - берём
Берём 42, 43 - как единицы - подходит
(1, 2, 5, 9, 11, 11, 12, 14) - как нули, подходят
Далее смотрим следующий разряд
() - как единицы
(все) - как нули - подходит
следующий разряд
({9, 11, 11, 12, 14}, (42, 43)) - как единицы - проблема, нечётное количество
({1, 2, 5}) - как нули
следующий разряд
(5, 12, 14)

*/

#include <vector>
#include <list>
#include <iostream>
#include <map>

using number_t = unsigned int;
using xor_t = unsigned int;

int main(void) {
    /*
    0 1 2 3 - 4 5 6 7 - 8 9 10 11 - 12 13 14 15 - каждые последовательные 4 элемента дают xor
    1)0 1 2 3 | 4 5 6 7 || 8 9 10 11 | 12 13 14 15 ||| 16 17 18 19 | 20 21 22 23 || 24 25 26 27 | 28 29 30 31
    
    Возвращаемся к старому методу решения:
    1)Вычисляем массив xor-ов (a1, a1^a2, a1^a2^a3...)
    Выбираем упорядоченное множество S = Sn, и упорядоченно множество элементов A = [] (в начале пустое, потому что нет элементов)
    Начальный cxor = 0
    Функция для S и A
    Выбираем последний элемент в S, (s_|S|)
    S_|S| = S_|S| ^ cxor
    Далее строим R - как продолжение S с использованем элементов из A
    И T - массив попарных xor  между элементом S_|S| и каждым отдельным элементом из A
    
    Тогда
    R_i = S_|S| ^ A1 ^ A2 ^ ... ^ Ai
    T_i = S_|S| ^ Ai
    Рассмотрим пример:
    42 3 1 3 6
    Поиск совпадения работает только в случае S = [42] и A = [3, 1, 3, 6]
    R = 41 40 43 45
    T = 41 43 41 44
    Суть в чём - если в R встречается значени позже чем в T, (пусть i - индекс элемента в R, j - индекс элемента в T), то есть i > j,
    тогда A[i+1:j+1] - есть часть цикла
    Заметка: проверь вариант [1002, 2, 11, 12, 34, 14, 16], здесь цикл должен быть 2, 12, 14, верхняя стратегия не работать

    */

    /*
    Итак раньше я сначала искал все возможные циклы xor, возможно стоит обратить внимание на что-то другое...
    На основе указанного множества вводим большой массив и в него вбиваем элементы:
    массив из 1 элмента (1)
    из 2-х элементов (2, 3)
    из 4-х элементов (4,5,6,7)
    из 8 элементов (8, 9, 10, 11, 12, 13, 14, 15)
    0111 xor 0110 = 1 = 7 - 6
    0111 x0r 0101 = 2 = 7 - 5
    0111 xor 0100 = 3 = 7 - 4

    0110 xor 0101 = 3 != 6 - 5
    0110 xor 0100 = 2 = 6 - 4
    
    0101 xor 0100 = 1 = 5 - 4
    
    1111 xor 1110 = 1 = 15 - 14
    1111 xor 1101 = 2 = 15 - 13
    1111 xor 1100 = 3 = 15 - 12
    1111 xor 1011 = 4 = 15 - 11
    1111 xor 1010 = 5 = 15 - 10
    1111 xor 1001 = 6 = 15 - 9
    1111 xor 1000 = 7 = 15 - 8

    1110 xor 1101 = 3 != 14 - 13
    1110 xor 1100 = 2 = 14 - 12
    1110 xor 1011 = 5 != 14 - 11
    1110 xor 1010 = 4 = 14 - 10
    1110 xor 1001 = 7 != 14 - 9
    1110 xor 1000 = 6 = 14 - 8

    1101 xor 1100 = 1 = 13 - 12
    1101 xor 1011 = 6 != 13 - 11
    1101 xor 1010 = 7 != 13 - 10
    1101 xor 1001 = 4 != 13 - 9
    1101 xor 1000 = 5 == 13 - 8
    
    1100 xor 1011 = 7 != 12 - 11
    1100 xor 1010 = 6 != 12 - 10
    1100 xor 1001 = 5 != 12 - 9
    1100 xor 1000 = 4 = 12 - 8

    1011 xor 1010 = 1 = 11 - 10
    1011 xor 1001 = 2 = 11 - 9
    1011 xor 1000 = 3 = 11 - 8

    1010 xor 1001 = 3 != 10 - 9
    1010 xor 1000 = 2 = 10 - 8

    1001 xor 1000 = 1 = 9 - 8
    (1)
    (2, 3)
    (4, 5, 6, 7)
    (8, 9, 10,11,12,13,14,15)
    (16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31)
    (32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63)

    Итак, надо изучить дерево Фенвика, явно задача на его использование
    */
    return 0;

}