#include <iostream>
#include <vector>
#include <algorithm>

int main(void) {
    std::size_t n = 0;
    std::vector<int> nums;

    std::cin >> n;
    n *= 2;
    nums.resize(n);
    for (auto &num : nums) {
        std::cin >> num;
    }
    /*
        Итак, нужно построить арифметическую последовательность из n элементов
        1)сортируем числа по возрастанию (нам нужно найти арифметическую последовательность, так найдем её по возрастанию)
        2)На основе метода Дирихле выясняем, что размер арифметической последовательности = n, количество элементов всего = 2n, значит 100% возможна ситуация, когда либо 2 члена последовательности стоят рядом, либо через элемент
        Тогда, вычисляем разности соседних и через 1 элемент
        prefix1[i] = nums[i] - nums[i-1]
        prefix2[i] = nums[i] - nums[i-2]
        Далее, проходимся по этим префиксам и записываем полученные значения в хеш-таблицу (размера n, или в set)
        Берём самую частую delta, создаём кольцевой буфер размера delta (могут быть похожие смещения)
        0 4 0 4 0 4 - 
        prefix1 = {4, -4, 4, -4, 4}
        prefix2 = {0, 0, 0, 0}
        4 0 0 4 4 0
        prefix1 = {-4, 0, 4, 0, -4}
        prefix2 = {-4, 4, 4, -4}
        Здесь d = -4 - неверно, у нас нельзя составить арифметическую последовательность с d = -4 с 3-мя элементами
        0 0 0 4 4 4
        prefix1 = {0, 0, 4, 0, 0}
        prefix2 = {0,}

        1 2 5 6 7 9
        prefix1 = {1,3,1,1,2}
        prefix2 = {4,4,2,3} - ну тут d = 1
        Расмотрим такой

        Итак, между 2-мя последовательными элементами арифметической прогрессии не могут стоять элементы, разность между которыми равна или больще d
        0 3 6 7 11 12 15 18
        prefix1 = {3, 3, 1, 4, 1, 3, 3}
        prefix2 = {6, 4, 5, 5, 4, 6}
        с d = 3 нельзя составить арифм прогр размера 4
        с d = 4 можно составить (3, 7, 11, 15)
        0 3 6 8 11 12 15 18
        prefix1 = {3,3,2,3,1,3,3}
        prefix2 = {6,5,5,4,4,6}
        Тут сразу проверяются 3, 4, 5, 6

        Хорошо, попробуем использовать двоичный поиск
        Итак, допустим у нас есть перемешанная последовательность
        Как найти в ней арифметическую последовательность?
        Итак, делим последовательность пополам
        [a_1 ... a_i] - первая упорядоченная последовательность
        [a_{i+1}...a_n] - вторая упорядоченная последовательность
        Если Если a_n - a_{i+1} > a_i - a_1, то скорее всего арифметическая прогрессия по большей части либо слева, либо справа
        И, что мы можем ?
        Допустим у меня есть арифм прогрессия 0 10 20 30 40
        Есть числа 5,6, 31,35,37
        0 5 6 10 20 30 31 35 37 40
        Дели пополам
        [0,20] и [30, 40]
        d1 = 20, d2 = 10
        Слева половина элементов, справа половина элементов
        5:20 и 5:10
        Между  ними d = 10

    */
    return 0;
}